import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: 'نقص الطوب',
    desc: 'يخسر جميع اللاعبين 8 طوب',
  },
  {
    name: 'مخبأ الحظ',
    desc: '\u200E+2 طوبة. \u200E+2 جوهرة. العب مرة أخرى',
  },
  {
    name: 'التضاريس الصديقة',
    desc: '\u200E+1 جدار. العب مرة أخرى',
  },
  {
    name: 'عمال المناجم',
    desc: '\u200E+1 محجر',
  },
  {
    name: 'الكنز الأم',
    desc: 'إذا كان المحجر < محجر العدو، \u200E+2 محجر. وإلا، \u200E+1 محجر',
  },
  {
    name: 'عمال المناجم الأقزام',
    desc: '\u200E+4 جدار. \u200E+1 محجر',
  },
  {
    name: 'وقت إضافي للعمل',
    desc: '\u200E+5 جدار. تخسر 6 جواهر',
  },
  {
    name: 'الحصول على التكنولوجيا',
    desc: 'إذا كان المحجر < محجر العدو، المحجر = محجر العدو',
  },
  {
    name: 'الجدار الأساسي',
    desc: '\u200E+3 جدار',
  },
  {
    name: 'الجدار القوي',
    desc: '\u200E+4 جدار',
  },
  {
    name: 'الابتكارات',
    desc: '\u200E+1 تكسب 4 جواهر في محاجر جميع اللاعبين',
  },
  {
    name: 'الأساسات',
    desc: 'إذا كان الجدار = 0، \u200E+6 جدار، وإلا \u200E+3 جدار',
  },
  {
    name: 'الارتعاشات',
    desc: 'تتلقى جميع الجدران 5 نقاط ضرر. العب مرة أخرى',
  },
  {
    name: 'الغرفة السرية',
    desc: '\u200E+1 سحر. العب مرة أخرى',
  },
  {
    name: 'الزلزال',
    desc: '\u200E-1 إلى جميع محاجر اللاعب',
  },
  {
    name: 'الجدار الكبير',
    desc: '\u200E+6 جدار',
  },
  {
    name: 'انهيار!',
    desc: '\u200E-1 محجر عدو',
  },
  {
    name: 'معدات جديدة',
    desc: '\u200E+2 محجر',
  },
  {
    name: 'منجم الشريط',
    desc: '\u200E-1 محجر. \u200E+10 جدار. تكسب 5 جواهر',
  },
  {
    name: 'الجدار المعزز',
    desc: '\u200E+8 جدار',
  },
  {
    name: 'بوابة البوابة',
    desc: '\u200E+5 جدار، \u200E+1 زنزانة',
  },
  {
    name: 'صخور الكريستال',
    desc: '\u200E+7 جدار، تكسب 7 جواهر',
  },
  {
    name: 'خام متناغم',
    desc: '\u200E+6 جدار، \u200E+3 برج',
  },
  {
    name: 'جدار موندو',
    desc: '\u200E+12 جدار',
  },
  {
    name: 'تصاميم محددة',
    desc: '\u200E+8 جدار، \u200E+5 برج',
  },
  {
    name: 'الجدار العظيم',
    desc: '\u200E+15 جدار',
  },
  {
    name: 'قاذف الصخور',
    desc: '\u200E+6 جدار. 10 ضرر للعدو',
  },
  {
    name: 'قلب التنين',
    desc: '\u200E+20 جدار. \u200E+8 برج',
  },
  {
    name: 'العمل القسري',
    desc: '\u200E+9 جدار، خسارة 5 مجندين',
  },
  {
    name: 'حديقة الصخور',
    desc: '\u200E+1 جدار. \u200E+1 برج. \u200E+2 مجندين',
  },
  {
    name: 'مياه الفيضان',
    desc: 'اللاعبون الذين لديهم أدنى جدار هم \u200E-1 زنزانة و2 ضرر للبرج',
  },
  {
    name: 'الثكنات',
    desc: '\u200E+6 مجندين، \u200E+6 جدار. إذا كانت الزنزانة < زنزانة العدو، \u200E+1 زنزانة',
  },
  {
    name: 'المعارك',
    desc: '\u200E+7 جدار، 6 ضرر للعدو',
  },
  {
    name: 'التحول',
    desc: 'بدّل جدارك بجدار العدو',
  },
  {
    name: 'الكوارتز',
    desc: '\u200E+1 برج. العب مرة أخرى',
  },
  {
    name: 'الكوارتز الدخاني',
    desc: '1 ضرر لبرج العدو. العب مرة أخرى',
  },
  {
    name: 'الجمشت',
    desc: '\u200E+3 برج',
  },
  {
    name: 'نساج التعويذات',
    desc: '\u200E+1 سحر',
  },
  {
    name: 'المنشور',
    desc: 'اسحب بطاقة واحدة. تخلص من بطاقة واحدة. العب مرة أخرى',
  },
  {
    name: 'حجر المغناطيس',
    desc: '\u200E+3 برج. لا يمكن التخلص من هذه البطاقة دون لعبها',
  },
  {
    name: 'الشعلة الشمسية',
    desc: '\u200E+2 برج. 2 ضرر لبرج العدو',
  },
  {
    name: 'مصفوفة الكريستال',
    desc: '\u200E+1 سحر. \u200E+3 برج. \u200E+1 برج العدو',
  },
  {
    name: 'عيب الأحجار الكريمة',
    desc: '3 ضرر لبرج العدو',
  },
  {
    name: 'ياقوت',
    desc: '\u200E+5 برج',
  },
  {
    name: 'رمح الأحجار الكريمة',
    desc: '5 ضرر لبرج العدو',
  },
  {
    name: 'حرق الطاقة',
    desc: '5 ضرر لبرجك. \u200E+2 سحر',
  },
  {
    name: 'اهتزاز متناغم',
    desc: '\u200E+1 سحر. \u200E+3 برج. \u200E+3 جدار',
  },
  {
    name: 'التكافؤ',
    desc: 'كل سحر اللاعب يساوي أعلى سحر للاعب',
  },
  {
    name: 'زمرد',
    desc: '\u200E+8 برج',
  },
  {
    name: 'لؤلؤة الحكمة',
    desc: '\u200E+5 برج. \u200E+1 سحر',
  },
  {
    name: 'محطم',
    desc: '\u200E-1 سحر. 9 ضرر لبرج العدو',
  },
  {
    name: 'حجر تفتت',
    desc: '\u200E+5 برج. العدو يخسر 6 طوب',
  },
  {
    name: 'ياقوت',
    desc: '\u200E+11 برج',
  },
  {
    name: 'ديسكورد',
    desc: '7 ضرر لجميع الأبراج، سحر جميع اللاعبين \u200E-1',
  },
  {
    name: 'ياقوت النار',
    desc: '\u200E+6 برج. 4 ضرر لبرج العدو',
  },
  {
    name: 'مساعدة المحجر',
    desc: '\u200E+7 برج. اخسر 10 طوب',
  },
  {
    name: 'درع الكريستال',
    desc: '\u200E+8 برج. \u200E+3 جدار',
  },
  {
    name: 'جوهرة التعاطف',
    desc: '\u200E+8 برج. \u200E+1 زنزانة',
  },
  {
    name: 'ماسة',
    desc: '\u200E+15 برج',
  },
  {
    name: 'ملاذ',
    desc: '\u200E+10 برج. \u200E+5 جدار، احصل على 5 مجندين',
  },
  {
    name: 'جوهرة الحمم البركانية',
    desc: '\u200E+12 برج. 6 ضرر للعدو',
  },
  {
    name: 'عين التنين',
    desc: '\u200E+20 برج',
  },
  {
    name: 'تبلور',
    desc: '\u200E+11 برج. \u200E-6 جدار',
  },
  {
    name: 'حقيبة زينة',
    desc: 'إذا كان البرج < برج العدو، \u200E+2 برج. وإلا \u200E+1 برج',
  },
  {
    name: 'قوس قزح',
    desc: '\u200E+1 برج لجميع اللاعبين. تحصل على 3 جواهر',
  },
  {
    name: 'متدرب',
    desc: '\u200E+4 برج، تخسر 3 مجندين، 2 ضرر لبرج العدو',
  },
  {
    name: 'شظية البرق',
    desc: 'إذا كان البرج > جدار العدو، 8 ضرر لبرج العدو. وإلا 8 ضرر',
  },
  {
    name: 'جوهرة المرحلة',
    desc: '\u200E+13 برج. \u200E+6 مجندين. \u200E+6 طوب',
  },
  {
    name: 'مرض جنون البقر',
    desc: 'يخسر جميع اللاعبين 6 مجندين',
  },
  {
    name: 'الجنية',
    desc: '2 ضرر. العب مرة أخرى',
  },
  {
    name: 'العفاريت المزاجية',
    desc: '4 ضرر. تخسر 3 جواهر',
  },
  {
    name: 'مينوتور',
    desc: '\u200E+1 زنزانة',
  },
  {
    name: 'كشاف الجان',
    desc: 'اسحب بطاقة واحدة. تخلص من بطاقة واحدة. العب مرة أخرى',
  },
  {
    name: 'حشد العفاريت',
    desc: '6 ضرر. تتلقى 3 أضرار',
  },
  {
    name: 'رماة العفاريت',
    desc: '3 ضرر لبرج العدو. تتلقى ضررًا واحدًا',
  },
  {
    name: 'جنية الظل',
    desc: '2 ضرر لبرج العدو. العب مرة أخرى',
  },
  {
    name: 'الأورك',
    desc: '5 ضرر',
  },
  {
    name: 'الأقزام',
    desc: '4 ضرر. \u200E+3 جدار',
  },
  {
    name: 'ثعابين صغيرة',
    desc: '4 ضرر لبرج العدو',
  },
  {
    name: 'مدرب الترولز',
    desc: '\u200E+2 برج الزنزانة',
  },
  {
    name: 'غريملين',
    desc: '2 ضرر. \u200E+4 برج. \u200E+2 جدار',
  },
  {
    name: 'القمر المكتمل',
    desc: '\u200E+1 لزنزانة جميع اللاعبين. تكسب 3 مجندين',
  },
  {
    name: 'سلاشر',
    desc: '6 ضرر',
  },
  {
    name: 'غول',
    desc: '7 ضرر',
  },
  {
    name: 'الأغنام المسعورة',
    desc: '6 ضرر. يخسر العدو 3 مجندين',
  },
  {
    name: 'عفريت',
    desc: '6 ضرر. يخسر جميع اللاعبين 5 قطع من الطوب والأحجار الكريمة والمجندين',
  },
  {
    name: 'سبيزر',
    desc: 'إذا كان جدار العدو = 0، 10 ضرر، وإلا 6 ضرر',
  },
  {
    name: 'مستذئب',
    desc: '9 ضرر',
  },
  {
    name: 'سحابة التآكل',
    desc: 'إذا كان جدار العدو > 0، 10 ضرر، وإلا 7 ضرر',
  },
  {
    name: 'وحيد القرن',
    desc: 'إذا كان السحر > سحر العدو، 12 ضرر، وإلا 8 ضرر',
  },
  {
    name: 'رماة الجان',
    desc: 'إذا كان الجدار > جدار العدو، 6 ضرر لبرج العدو، وإلا 6 ضرر',
  },
  {
    name: 'سكوبس',
    desc: '5 ضرر لبرج العدو، يخسر العدو 8 مجندين',
  },
  {
    name: 'مطواطم الصخور',
    desc: '8 ضرر، \u200E-1 محجر العدو',
  },
  {
    name: 'لص',
    desc: 'يخسر العدو 10 جواهر، 5 قطع من الطوب، تكسب 1/2 كمية. جولة لأعلى',
  },
  {
    name: 'عملاق حجري',
    desc: '10 ضرر. \u200E+4 جدار',
  },
  {
    name: 'مصاص دماء',
    desc: '10 ضرر. يخسر العدو 5 مجندين، \u200E-1 زنزانة عدو',
  },
  {
    name: 'تنين',
    desc: '20 ضرر. العدو يخسر 10 جواهر، \u200E-1 زنزانة عدو',
  },
  {
    name: 'رماح',
    desc: 'إذا كان الجدار > جدار العدو يسبب 3 أضرار وإلا يسبب 2 ضرر',
  },
  {
    name: 'قزم',
    desc: '3 ضرر. \u200E+1 جوهرة',
  },
  {
    name: 'المحارب الهائج',
    desc: '8 ضرر. 3 ضرر لبرجك',
  },
  {
    name: 'أمير الحرب',
    desc: '13 ضرر. تخسر 3 جواهر',
  },
  {
    name: 'رمح بيجاسوس',
    desc: '12 ضرر لبرج العدو',
  },
]
