import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: 'レンガ不足',
    desc: 'すべてのプレイヤーが8個のレンガを失います',
  },
  {
    name: 'ラッキーキャッシュ',
    desc: '+2レンガ。+2宝石。再びプレー',
  },
  {
    name: 'フレンドリーな地形',
    desc: '+1壁。再びプレー',
  },
  {
    name: '鉱夫',
    desc: '+1採石場',
  },
  {
    name: '主脈',
    desc: '採石場<敵の採石場の場合、+2採石場。それ以外の場合、+1採石場',
  },
  {
    name: 'ドワーフの鉱夫',
    desc: '+4壁。+1採石場',
  },
  {
    name: '残業する',
    desc: '+5壁。あなたは6つの宝石を失います',
  },
  {
    name: '技術のコッピング',
    desc: '採石場<敵の採石場の場合、採石場=敵の採石場',
  },
  {
    name: '基本的な壁',
    desc: '+3壁',
  },
  {
    name: '頑丈な壁',
    desc: '+4壁',
  },
  {
    name: 'イノベーション',
    desc: '+1すべてのプレイヤーの採石場に、4つの宝石を獲得します',
  },
  {
    name: '基礎',
    desc: '壁=0の場合、+6壁、それ以外の場合+3壁',
  },
  {
    name: '震え',
    desc: 'すべての壁は5ダメージを受ける。再びプレー',
  },
  {
    name: '秘密の部屋',
    desc: '+1魔法。再びプレー',
  },
  {
    name: '地震',
    desc: '-1すべてのプレイヤーの採石場へ',
  },
  {
    name: '大きな壁',
    desc: '+6壁',
  },
  {
    name: '崩壊！',
    desc: '-1つの敵の採石場',
  },
  {
    name: '新しい機器',
    desc: '+2採石場',
  },
  {
    name: 'ストリップマイン',
    desc: '-1採石場。+10壁。あなたは5つの宝石を手に入れます',
  },
  {
    name: '補強壁',
    desc: '+8壁',
  },
  {
    name: 'ポルティキュラス',
    desc: '+5壁、+1ダンジョン',
  },
  {
    name: 'クリスタルロックス',
    desc: '+7壁、7つの宝石を獲得',
  },
  {
    name: '調和鉱石',
    desc: '+6壁、+3塔',
  },
  {
    name: 'モンドの壁',
    desc: '+12壁',
  },
  {
    name: '集束デザイン',
    desc: '+8壁、+5塔',
  },
  {
    name: 'グレートウォール',
    desc: '+15壁',
  },
  {
    name: 'ロックランチャー',
    desc: '+6壁。10敵へのダメージ',
  },
  {
    name: 'ドラゴンの心',
    desc: '+20壁。+8塔',
  },
  {
    name: '強制労働',
    desc: '+9壁、怪獣5体を失う',
  },
  {
    name: 'ロックガーデン',
    desc: '+1壁。+1塔。+2怪獣',
  },
  {
    name: '洪水の水',
    desc: '壁が最も低いプレイヤー：-1ダンジョン、塔に2ダメージ',
  },
  {
    name: '兵舎',
    desc: '+6怪獣、+6壁。ダンジョン<敵ダンジョンの場合、+1ダンジョン',
  },
  {
    name: '胸壁',
    desc: '+7壁、敵に6ダメージ',
  },
  {
    name: 'シフト',
    desc: '壁を敵の壁に切り替えます',
  },
  {
    name: '石英',
    desc: '+1塔。再びプレー',
  },
  {
    name: 'スモーキークォーツ',
    desc: '1敵の塔へのダメージ。再びプレー',
  },
  {
    name: 'アメジスト',
    desc: '+3塔',
  },
  {
    name: 'スペルウィーバー',
    desc: '+1魔法',
  },
  {
    name: 'プリズム',
    desc: 'カードを1枚引く。カードを1枚捨てる。再びプレー',
  },
  {
    name: 'ロドストーン',
    desc: '+3塔。このカードはプレイせずに捨てることはできません',
  },
  {
    name: '太陽フレア',
    desc: '+2塔。2敵の塔へのダメージ',
  },
  {
    name: '結晶マトリックス',
    desc: '+1魔法。+3塔。+1敵の塔',
  },
  {
    name: '宝石の欠陥',
    desc: '3敵の塔へのダメージ',
  },
  {
    name: 'ルビー',
    desc: '+5塔',
  },
  {
    name: '宝石の槍',
    desc: '5敵の塔へのダメージ',
  },
  {
    name: 'パワーバーン',
    desc: '5自分の塔へのダメージ。+2魔法',
  },
  {
    name: 'ハーモニックバイブ',
    desc: '+1魔法。+3塔。+3壁',
  },
  {
    name: 'パリティ',
    desc: 'すべてのプレイヤーの魔法は、すべてのプレイヤーの中で最高の魔法に等しい',
  },
  {
    name: 'エメラルド',
    desc: '+8塔',
  },
  {
    name: '知恵の真珠',
    desc: '+5塔。+1魔法',
  },
  {
    name: '粉砕機',
    desc: '-1魔法。9敵の塔へのダメージ',
  },
  {
    name: '崩れ石',
    desc: '+5塔。敵は6つのレンガを失います',
  },
  {
    name: 'サファイア',
    desc: '+11塔',
  },
  {
    name: '不和',
    desc: '7全塔へのダメージ、全プレイヤーの魔法-1',
  },
  {
    name: 'ファイアルビー',
    desc: '+6塔。4敵の塔へのダメージ',
  },
  {
    name: '採石場の助け',
    desc: '+7塔。10個のレンガを失う',
  },
  {
    name: 'クリスタルシールド',
    desc: '+8塔。+3壁',
  },
  {
    name: '共感の宝石',
    desc: '+8塔。+1ダンジョン',
  },
  {
    name: 'ダイヤモンド',
    desc: '+15塔',
  },
  {
    name: '聖域',
    desc: '+10塔。+5壁、5体の怪獣を獲得',
  },
  {
    name: '溶岩の宝石',
    desc: '+12塔。6敵へのダメージ',
  },
  {
    name: 'ドラゴンの目',
    desc: '+20塔',
  },
  {
    name: '結晶化する',
    desc: '+11塔。-6壁',
  },
  {
    name: '装身具の袋',
    desc: '塔<敵の塔の場合、+2塔。それ以外の場合は+1塔',
  },
  {
    name: '虹',
    desc: '全プレイヤーに+1塔。あなたは3つの宝石を得る',
  },
  {
    name: '見習い',
    desc: '+4塔、自分は怪獣を3体失う、敵の塔に2ダメージ',
  },
  {
    name: '稲妻の破片',
    desc: '塔>敵の壁の場合、敵の塔に8ダメージ。それ以外の場合は8ダメージ',
  },
  {
    name: 'フェーズジュエル',
    desc: '+13塔。+6怪獣。+6レンガ',
  },
  {
    name: '狂牛病',
    desc: 'すべてのプレイヤーは6体の怪獣を失います',
  },
  {
    name: '妖精',
    desc: '2ダメージ。再びプレー',
  },
  {
    name: '気性の荒いゴブリン',
    desc: '4ダメージ。あなたは3つの宝石を失います',
  },
  {
    name: 'ミノタウロス',
    desc: '+1ダンジョン',
  },
  {
    name: 'エルフスカウト',
    desc: 'カードを1枚引く。カードを1枚捨てる。再びプレー',
  },
  {
    name: 'ゴブリン暴徒',
    desc: '6ダメージ。あなたは3ダメージを受ける',
  },
  {
    name: 'ゴブリン射手',
    desc: '3敵の塔へのダメージ。あなたは1ダメージを受ける',
  },
  {
    name: '影の妖精',
    desc: '2敵の塔へのダメージ。再びプレー',
  },
  {
    name: 'オーク',
    desc: '5ダメージ',
  },
  {
    name: 'ドワーフ',
    desc: '4ダメージ。+3壁',
  },
  {
    name: '小さなヘビ',
    desc: '4敵の塔へのダメージ',
  },
  {
    name: 'トロールトレーナー',
    desc: '+2ダンジョン',
  },
  {
    name: 'タワーグレムリン',
    desc: '2ダメージ。+4塔。+2壁',
  },
  {
    name: '満月',
    desc: 'すべてのプレイヤーのダンジョンに+1。あなたは3体の怪獣を獲得します',
  },
  {
    name: 'スラッシャー',
    desc: '6ダメージ',
  },
  {
    name: 'オーガ',
    desc: '7ダメージ',
  },
  {
    name: '狂暴な羊',
    desc: '6ダメージ。敵は3体の怪獣を失う',
  },
  {
    name: 'インプ',
    desc: '6ダメージ。すべてのプレイヤーは5つのレンガ、宝石、怪獣を失います',
  },
  {
    name: 'スピザー',
    desc: '敵の壁=0の場合、10ダメージ、それ以外の場合は6ダメージ',
  },
  {
    name: '人狼',
    desc: '9ダメージ',
  },
  {
    name: '腐食雲',
    desc: '敵の壁が0より大きい場合、10のダメージ、それ以外の場合は7のダメージ',
  },
  {
    name: 'ユニコーン',
    desc: '魔法>敵の魔法の場合、12ダメージ、それ以外の場合は8ダメージ',
  },
  {
    name: 'エルフの射手',
    desc: '壁>敵の壁の場合、敵の塔に6ダメージ、それ以外の場合は6ダメージ',
  },
  {
    name: '夢魔',
    desc: '5敵の塔にダメージを与え、敵は8体の怪獣を失う',
  },
  {
    name: 'ロックストンパー',
    desc: '8ダメージ、-1敵の採石場',
  },
  {
    name: '泥棒',
    desc: '敵は10個の宝石と5個のレンガを失い、半分の量を獲得し、切り上げます',
  },
  {
    name: '石の巨人',
    desc: '10ダメージ。+4壁',
  },
  {
    name: '吸血鬼',
    desc: '10ダメージ。敵は怪獣を5体失う。敵のダンジョンを-1',
  },
  {
    name: 'ドラゴン',
    desc: '20ダメージ。敵は宝石を10個失う。敵のダンジョンを-1',
  },
  {
    name: 'スピアマン',
    desc: '壁>敵の壁の場合、3ダメージ、それ以外の場合、2ダメージ',
  },
  {
    name: '地の精',
    desc: '3ダメージ。+1宝石',
  },
  {
    name: 'バーサーカー',
    desc: '8ダメージ。自分の塔に3ダメージ',
  },
  {
    name: '武将',
    desc: '13ダメージ。あなたは3つの宝石を失います',
  },
  {
    name: 'ペガサスランサー',
    desc: '12敵の塔へのダメージ',
  },
]
