import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: '벽돌 부족',
    desc: '모든 플레이어가 벽돌 8개를 잃습니다',
  },
  {
    name: '행운의 보물',
    desc: '+2 벽돌. +2 보석. 다시 플레이',
  },
  {
    name: '우호적인 지형',
    desc: '+1 성벽. 다시 플레이',
  },
  {
    name: '광부',
    desc: '+1 채석장',
  },
  {
    name: '광맥',
    desc: '채석장 < 적 채석장이면, +2 채석장. 그렇지 않으면, +1 채석장',
  },
  {
    name: '드워프 광부',
    desc: '+4 성벽. +1 채석장',
  },
  {
    name: '초과 근무',
    desc: '+5 성벽. 보석 6개를 잃습니다',
  },
  {
    name: '기술 도용',
    desc: '채석장 < 적 채석장이면, 채석장 = 적 채석장',
  },
  {
    name: '기본 성벽',
    desc: '+3 성벽',
  },
  {
    name: '견고한 성벽',
    desc: '+4 성벽',
  },
  {
    name: '혁신',
    desc: '모든 플레이어의 채석장 +1, 보석 4개 획득',
  },
  {
    name: '기초',
    desc: '성벽 = 0이면, +6 성벽, 그렇지 않으면 +3 성벽',
  },
  {
    name: '지진',
    desc: '모든 성벽이 피해 5를 받습니다. 다시 플레이',
  },
  {
    name: '비밀 방',
    desc: '+1 마법. 다시 플레이',
  },
  {
    name: '대지진',
    desc: '모든 플레이어의 채석장 -1',
  },
  {
    name: '큰 성벽',
    desc: '+6 성벽',
  },
  {
    name: '붕괴!',
    desc: '적 채석장 -1',
  },
  {
    name: '신형 장비',
    desc: '+2 채석장',
  },
  {
    name: '노천 광산',
    desc: '-1 채석장. +10 성벽. 보석 5개 획득',
  },
  {
    name: '보강 성벽',
    desc: '+8 성벽',
  },
  {
    name: '차단문',
    desc: '+5 성벽, +1 던전',
  },
  {
    name: '수정 바위',
    desc: '+7 성벽, 보석 7개 획득',
  },
  {
    name: '조화 광석',
    desc: '+6 성벽, +3 탑',
  },
  {
    name: '거대한 성벽',
    desc: '+12 성벽',
  },
  {
    name: '집중 설계',
    desc: '+8 성벽, +5 탑',
  },
  {
    name: '위대한 성벽',
    desc: '+15 성벽',
  },
  {
    name: '바위 발사기',
    desc: '+6 성벽. 적에게 피해 10',
  },
  {
    name: '용의 심장',
    desc: '+20 성벽. +8 탑',
  },
  {
    name: '강제 노동',
    desc: '+9 성벽, 병사 5명을 잃습니다',
  },
  {
    name: '바위 정원',
    desc: '+1 성벽. +1 탑. +2 병사',
  },
  {
    name: '홍수',
    desc: '성벽이 가장 낮은 플레이어는 -1 던전, 탑에 피해 2',
  },
  {
    name: '병영',
    desc: '+6 병사, +6 성벽. 던전 < 적 던전이면, +1 던전',
  },
  {
    name: '성가퀴',
    desc: '+7 성벽, 적에게 피해 6',
  },
  {
    name: '전환',
    desc: '당신의 성벽과 적의 성벽을 교환합니다',
  },
  {
    name: '석영',
    desc: '+1 탑. 다시 플레이',
  },
  {
    name: '연기 석영',
    desc: '적 탑에 피해 1. 다시 플레이',
  },
  {
    name: '자수정',
    desc: '+3 탑',
  },
  {
    name: '주문 직조사',
    desc: '+1 마법',
  },
  {
    name: '프리즘',
    desc: '카드 1장 뽑기. 카드 1장 버리기. 다시 플레이',
  },
  {
    name: '자력석',
    desc: '+3 탑. 이 카드는 사용하지 않고 버릴 수 없습니다',
  },
  {
    name: '태양 플레어',
    desc: '+2 탑. 적 탑에 피해 2',
  },
  {
    name: '수정 매트릭스',
    desc: '+1 마법. +3 탑. +1 적 탑',
  },
  {
    name: '보석 결함',
    desc: '적 탑에 피해 3',
  },
  {
    name: '루비',
    desc: '+5 탑',
  },
  {
    name: '보석 창',
    desc: '적 탑에 피해 5',
  },
  {
    name: '파워 번',
    desc: '당신의 탑에 피해 5. +2 마법',
  },
  {
    name: '조화 바이브',
    desc: '+1 마법. +3 탑. +3 성벽',
  },
  {
    name: '패리티',
    desc: '모든 플레이어의 마법이 가장 높은 플레이어의 마법과 같아집니다',
  },
  {
    name: '에메랄드',
    desc: '+8 탑',
  },
  {
    name: '지혜의 진주',
    desc: '+5 탑. +1 마법',
  },
  {
    name: '분쇄기',
    desc: '-1 마법. 적 탑에 피해 9',
  },
  {
    name: '부서지는 돌',
    desc: '+5 탑. 적이 벽돌 6개를 잃습니다',
  },
  {
    name: '사파이어',
    desc: '+11 탑',
  },
  {
    name: '불화',
    desc: '모든 탑에 피해 7, 모든 플레이어의 마법 -1',
  },
  {
    name: '화염 루비',
    desc: '+6 탑. 적 탑에 피해 4',
  },
  {
    name: '채석장의 도움',
    desc: '+7 탑. 벽돌 10개를 잃습니다',
  },
  {
    name: '수정 방패',
    desc: '+8 탑. +3 성벽',
  },
  {
    name: '공감 보석',
    desc: '+8 탑. +1 던전',
  },
  {
    name: '다이아몬드',
    desc: '+15 탑',
  },
  {
    name: '성역',
    desc: '+10 탑. +5 성벽, 병사 5명 획득',
  },
  {
    name: '용암 보석',
    desc: '+12 탑. 적에게 피해 6',
  },
  {
    name: '용의 눈',
    desc: '+20 탑',
  },
  {
    name: '결정화',
    desc: '+11 탑. -6 성벽',
  },
  {
    name: '장식품 주머니',
    desc: '탑 < 적 탑이면, +2 탑. 그렇지 않으면 +1 탑',
  },
  {
    name: '무지개',
    desc: '모든 플레이어의 탑 +1. 보석 3개 획득',
  },
  {
    name: '견습생',
    desc: '+4 탑, 병사 3명을 잃습니다, 적 탑에 피해 2',
  },
  {
    name: '번개 파편',
    desc: '탑 > 적 성벽이면, 적 탑에 피해 8. 그렇지 않으면 피해 8',
  },
  {
    name: '위상 보석',
    desc: '+13 탑. +6 병사. +6 벽돌',
  },
  {
    name: '광우병',
    desc: '모든 플레이어가 병사 6명을 잃습니다',
  },
  {
    name: '요정',
    desc: '피해 2. 다시 플레이',
  },
  {
    name: '변덕스러운 고블린',
    desc: '피해 4. 보석 3개를 잃습니다',
  },
  {
    name: '미노타우로스',
    desc: '+1 던전',
  },
  {
    name: '엘프 정찰병',
    desc: '카드 1장 뽑기. 카드 1장 버리기. 다시 플레이',
  },
  {
    name: '고블린 폭도',
    desc: '피해 6. 당신은 피해 3을 받습니다',
  },
  {
    name: '고블린 궁수',
    desc: '적 탑에 피해 3. 당신은 피해 1을 받습니다',
  },
  {
    name: '그림자 요정',
    desc: '적 탑에 피해 2. 다시 플레이',
  },
  {
    name: '오크',
    desc: '피해 5',
  },
  {
    name: '드워프',
    desc: '피해 4. +3 성벽',
  },
  {
    name: '작은 뱀',
    desc: '적 탑에 피해 4',
  },
  {
    name: '트롤 훈련사',
    desc: '+2 던전',
  },
  {
    name: '탑 그렘린',
    desc: '피해 2. +4 탑. +2 성벽',
  },
  {
    name: '보름달',
    desc: '모든 플레이어의 던전 +1. 병사 3명 획득',
  },
  {
    name: '도살자',
    desc: '피해 6',
  },
  {
    name: '오거',
    desc: '피해 7',
  },
  {
    name: '광란의 양',
    desc: '피해 6. 적이 병사 3명을 잃습니다',
  },
  {
    name: '임프',
    desc: '피해 6. 모든 플레이어가 벽돌, 보석, 병사 각 5개씩 잃습니다',
  },
  {
    name: '스피저',
    desc: '적 성벽 = 0이면, 피해 10, 그렇지 않으면 피해 6',
  },
  {
    name: '늑대인간',
    desc: '피해 9',
  },
  {
    name: '부식 구름',
    desc: '적 성벽 > 0이면, 피해 10, 그렇지 않으면 피해 7',
  },
  {
    name: '유니콘',
    desc: '마법 > 적 마법이면, 피해 12, 그렇지 않으면 피해 8',
  },
  {
    name: '엘프 궁수',
    desc: '성벽 > 적 성벽이면, 적 탑에 피해 6, 그렇지 않으면 피해 6',
  },
  {
    name: '서큐버스',
    desc: '적 탑에 피해 5, 적이 병사 8명을 잃습니다',
  },
  {
    name: '바위 짓밟기',
    desc: '피해 8, 적 채석장 -1',
  },
  {
    name: '도둑',
    desc: '적이 보석 10개, 벽돌 5개를 잃고, 당신은 그 절반(올림)을 획득합니다',
  },
  {
    name: '돌 거인',
    desc: '피해 10. +4 성벽',
  },
  {
    name: '뱀파이어',
    desc: '피해 10. 적이 병사 5명을 잃습니다, 적 던전 -1',
  },
  {
    name: '드래곤',
    desc: '피해 20. 적이 보석 10개를 잃습니다, 적 던전 -1',
  },
  {
    name: '창병',
    desc: '성벽 > 적 성벽이면 피해 3, 그렇지 않으면 피해 2',
  },
  {
    name: '놈',
    desc: '피해 3. +1 보석',
  },
  {
    name: '광전사',
    desc: '피해 8. 당신의 탑에 피해 3',
  },
  {
    name: '전쟁 군주',
    desc: '피해 13. 보석 3개를 잃습니다',
  },
  {
    name: '페가수스 창기병',
    desc: '적 탑에 피해 12',
  },
]
