import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: 'Нестача Цегли',
    desc: 'Обидва гравці втрачають 8 Цеглин',
  },
  {
    name: 'Вдала Знахідка',
    desc: '+2 Цегли. +2 Самоцвіти. Ходите знову',
  },
  {
    name: 'Благодатний Грунт',
    desc: '+1 до Стіни. Ходите знову',
  },
  {
    name: 'Гірники',
    desc: "+1 до Кар'єру",
  },
  {
    name: 'Багате Родовище',
    desc: "Якщо Ваш Ка'єр < Ка'єр опонента, то +2 до Кар'єру. Інакше +1 до Кар'єру",
  },
  {
    name: 'Гірські Гноми',
    desc: "+4 до Стіни. +1 до Кар'єру",
  },
  {
    name: 'Понаднормові',
    desc: '+5 до Стіни. Ви втрачаєте 6 Самоцвітів',
  },
  {
    name: 'Шпіонаж',
    desc: "Якщо Ваш Кар'єр < Ка'єр опонента, то він стає того ж рівня",
  },
  {
    name: 'Звичайна Стіна',
    desc: '+3 до Стіни',
  },
  {
    name: 'Міцна Стіна',
    desc: '+4 до Стіни',
  },
  {
    name: 'Інновації',
    desc: "+1 до Кар'єру у обох гравців. Ви отримуєте 4 Самоцвіти",
  },
  {
    name: 'Фундамент',
    desc: 'Якщо Ваша Стіна = 0, то +6 до Стіни. Інакше +3 до Стіни',
  },
  {
    name: 'Землетрус',
    desc: '5 од. втрат Стінам обох гравців. Ходите знову',
  },
  {
    name: 'Таємна Кімната',
    desc: '+1 до Магії. Ходите знову',
  },
  {
    name: 'Завала',
    desc: "-1 до Кар'єру у обох гравців",
  },
  {
    name: 'Висока Стіна',
    desc: '+6 до Стіни',
  },
  {
    name: 'Обвалення',
    desc: "-1 до Кар'єру опонента",
  },
  {
    name: 'Нове Обладнання',
    desc: "+2 до Кар'єру",
  },
  {
    name: 'Спустошення Надр',
    desc: "-1 до Кар'єру. +10 до Стіни. +5 Самоцвітів",
  },
  {
    name: 'Укріплена Стіна',
    desc: '+8 до Стіни',
  },
  {
    name: 'Портик',
    desc: '+5 до Стіни. +1 до Підземелля',
  },
  {
    name: 'Кристали Кварцу',
    desc: '+7 до Стіни. +7 Самоцвітів',
  },
  {
    name: 'Співоча Руда',
    desc: '+6 до Стіни. +3 до Вежі',
  },
  {
    name: 'Бастіон',
    desc: '+12 до Стіни',
  },
  {
    name: 'Інженерне Рішення',
    desc: '+8 до Стіни. +5 до Вежі',
  },
  {
    name: 'Велика Стіна',
    desc: '+15 до Стіни',
  },
  {
    name: 'Катапульта',
    desc: '+6 до Стіни. 10 од. втрат опоненту',
  },
  {
    name: 'Серце Дракона',
    desc: '+20 до Стіни. +8 до Вежі',
  },
  {
    name: 'Рабська Праця',
    desc: '+9 до Стіни. Ви втрачаєте 5 Істот',
  },
  {
    name: 'Сад Каменів',
    desc: '+1 до Стіни. +1 до Вежі. +2 Істоти',
  },
  {
    name: 'Повінь',
    desc: '-1 до Підземелля і 2 од. втрат Вежі гравця з меншою Стіною',
  },
  {
    name: 'Казарми',
    desc: '+6 Істот. +6 до Стіни. Якщо Підземелля < Підземелля опонента, то +1 до Підземелля',
  },
  {
    name: 'Зубчаті Стіни',
    desc: '+7 до Стіни. 6 од. втрат опоненту',
  },
  {
    name: 'Зсув',
    desc: 'Стіни гравців міняються місцями',
  },
  {
    name: 'Кришталь',
    desc: '+1 до Вежі. Ходите знову',
  },
  {
    name: 'Димчастий Кварц',
    desc: '1 од. втрат Вежі опонента. Ходите знову',
  },
  {
    name: 'Аметист',
    desc: '+3 до Вежі',
  },
  {
    name: 'Заклинателі',
    desc: '+1 до Магії',
  },
  {
    name: 'Призма',
    desc: 'Візьміть 1 карту. Скиньте 1 карту. Ходите знову',
  },
  {
    name: 'Магніт',
    desc: '+3 до Вежі. Цю карту не можна скинути',
  },
  {
    name: 'Спалах на Сонці',
    desc: '+2 до Вежі. 2 од. втрат Вежі опонента',
  },
  {
    name: 'Матриця',
    desc: '+1 до Магії. +3 до Вежі. +1 до Вежі опонента',
  },
  {
    name: 'Тріснутий Камінь',
    desc: '3 од. втрат Вежі опонента',
  },
  {
    name: 'Рубін',
    desc: '+5 до Вежі',
  },
  {
    name: 'Кришталевий Спис',
    desc: '5 од. втрат Вежі опонента',
  },
  {
    name: 'Вибух Сили',
    desc: '5 од. втрат вашій Вежі. +2 до Магії',
  },
  {
    name: 'Гармонія',
    desc: '+1 до Магії. +3 до Вежі. +3 до Стіни',
  },
  {
    name: 'Рівність',
    desc: 'Магія обох гравців стає равна більшій Магії',
  },
  {
    name: 'Смарагд',
    desc: '+8 до Вежі',
  },
  {
    name: 'Перлина Мудрості',
    desc: '+5 до Вежі. +1 до Магії',
  },
  {
    name: 'Руїна',
    desc: '-1 до Магії. 9 од. втрат Вежі опонента',
  },
  {
    name: 'Каменедробарка',
    desc: '+5 до Вежі. Ворог втрачає 6 Цеглин',
  },
  {
    name: 'Сапфір',
    desc: '+11 до Вежі',
  },
  {
    name: 'Розбрат',
    desc: '7 од. втрат Вежам і -1 до Магії у обох гравців',
  },
  {
    name: 'Вогняний Рубін',
    desc: '+6 до Вежі. 4 од. втрат Вежі опонента',
  },
  {
    name: 'Допомога Гірників',
    desc: '+7 до Вежі. Ви втрачаєте 10 Цеглин',
  },
  {
    name: 'Кришталевий Щит',
    desc: '+8 до Вежі. +3 до Стіни',
  },
  {
    name: 'Камінь Емпатії',
    desc: '+8 до Вежі. +1 до Підземелля',
  },
  {
    name: 'Алмаз',
    desc: '+15 до Вежі',
  },
  {
    name: 'Святилище',
    desc: '+10 до Вежі. +5 до Стіни. +5 Істот',
  },
  {
    name: 'Лавовый Камінь',
    desc: '+12 до Вежі. 6 од. втрат опоненту',
  },
  {
    name: 'Око Дракона',
    desc: '+20 до Вежі',
  },
  {
    name: 'Кристалізація',
    desc: '+11 до Вежі. -6 до Стіни',
  },
  {
    name: 'Біжутерія',
    desc: 'Якщо Ваша Вежа < Вежі опонента, то +2 до Вежі. Інакше +1 до Вежі',
  },
  {
    name: 'Веселка',
    desc: '+1 до Веж обох гравців. Ви отримуєте 3 Самоцвіти',
  },
  {
    name: 'Підмайстер',
    desc: '+4 до Вежі. 2 од. втрат Вежі опонента. Ви втрачаєте 3 Істоти',
  },
  {
    name: 'Блискавка',
    desc: 'Якщо Ваша Вежа > Стіни опонента, то 8 од. втрат Вежі опонента. Інакше 8 од. втрат',
  },
  {
    name: 'Фазовый Камінь',
    desc: '+13 до Вежі. +6 Істот. +6 Цеглин',
  },
  {
    name: "Коров'ячий Сказ",
    desc: 'Обидва гравці втрачають по 6 Істот',
  },
  {
    name: 'Фея',
    desc: '2 од. втрат. Ходите знову',
  },
  {
    name: 'Жадібні Гобліни',
    desc: '4 од. втрат. Ви втрачаєте 3 Самоцвіти',
  },
  {
    name: 'Мінотавр',
    desc: '+1 до Підземелля',
  },
  {
    name: 'Ельф-розвідник',
    desc: 'Візьміть 1 карту. Скиньте 1 карту. Ходите знову',
  },
  {
    name: 'Юрба Гоблінів',
    desc: '6 од. втрат опоненту. 3 од. втрат Вам',
  },
  {
    name: 'Гобліни-стрільці',
    desc: '3 од. втрат Вежі опонента. 1 од. втрат Вам',
  },
  {
    name: 'Темна Фея',
    desc: '2 од. втрат Вежі опонента. Ходите знову',
  },
  {
    name: 'Орк',
    desc: '5 од. втрат опоненту',
  },
  {
    name: 'Гноми',
    desc: '4 од. втрат опоненту. +3 до Стіни',
  },
  {
    name: 'Змійки',
    desc: '4 од. втрат Вежі опонента',
  },
  {
    name: 'Троль-наглядач',
    desc: '+2 до Підземелля',
  },
  {
    name: 'Гремліни',
    desc: '2 од. втрат опоненту. +4 до Вежі. +2 до Стіни',
  },
  {
    name: 'Повня',
    desc: '+1 до Підземель обох гравців. Ви отримуєте 3 Істоти',
  },
  {
    name: 'Рубака',
    desc: '6 од. втрат опоненту',
  },
  {
    name: 'Огр',
    desc: '7 од. втрат опоненту',
  },
  {
    name: 'Скажена Вівця',
    desc: '6 од. втрат опоненту. Ворог втрачає 3 Істоти',
  },
  {
    name: 'Біс',
    desc: '6 од. втрат опоненту. Обидва гравця втрачають по 5 од. кожного ресурсу',
  },
  {
    name: 'Жук-бомбардир',
    desc: 'Якщо Стіна опонента = 0, то 10 од. втрат опоненту. Інакше 6 од. втрат',
  },
  {
    name: 'Вовкулак',
    desc: '9 од. втрат',
  },
  {
    name: 'Їдка Хмара',
    desc: 'Якщо Стіна опонента > 0, то 10 од. втрат опоненту. Інакше 7 од. втрат',
  },
  {
    name: 'Єдиноріг',
    desc: 'Якщо Вага Магія > Магію опонента, то 12 од. втрат опоненту. Інакше 8 од. втрат',
  },
  {
    name: 'Ельфи-лучники',
    desc: 'Якщо Ваша Стіна > Стіну опонента, то 6 од. втрат Вежі опонента. Інакше 6 од. втрат',
  },
  {
    name: 'Суккуб',
    desc: '5 од. втрат Вежі опонента. Ворог втрачає 8 Істот',
  },
  {
    name: 'Камнегриз',
    desc: "8 од. втрат опоненту. -1 до Кар'єру опонента",
  },
  {
    name: 'Злодій',
    desc: 'Ворог втрачає 10 Самоцвітів і 5 Цеглин. Ви отримуєте половину з цього',
  },
  {
    name: "Кам'яний Велетень",
    desc: '+4 до Стіни. 10 од. втрат опоненту',
  },
  {
    name: 'Упир',
    desc: '10 од. втрат опоненту. -1 до Підземелля опонента. Ворог втрачає 5 Істот',
  },
  {
    name: 'Дракон',
    desc: '20 од. втрат опоненту. -1 до Підземелля опонента. Ворог втрачає 10 Самоцвітів',
  },
  {
    name: 'Пікінер',
    desc: 'Якщо Ваша Стіна > Стіну опонента, то 3 од. втрат опоненту. Інакше 2 од. втрат',
  },
  {
    name: 'Карлик',
    desc: '3 од. втрат опоненту. +1 Самоцвіт',
  },
  {
    name: 'Берсерк',
    desc: '8 од. втрат опоненту. 3 од. втрат вашій Вежі',
  },
  {
    name: 'Войовник',
    desc: '13 од. втрат опоненту. Ви втрачаєте 3 Самоцвіти',
  },
  {
    name: 'Вершник на Пегасі',
    desc: '12 од. втрат Вежі опонента',
  },
]
