import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: '磚塊短缺',
    desc: '雙方同時失去8塊磚塊',
  },
  {
    name: '幸運寶藏',
    desc: '磚塊+2，寶石+2，再次出牌',
  },
  {
    name: '友善地形',
    desc: '城牆+1，再次出牌',
  },
  {
    name: '偉大礦工',
    desc: '磚塊產量+1',
  },
  {
    name: '礦石主脈',
    desc: '如果磚塊產量少於對手，則磚塊產量+2，否則+1',
  },
  {
    name: '矮人礦工',
    desc: '城牆+4，磚塊產量+1',
  },
  {
    name: '加班工作',
    desc: '城牆+5，寶石-6',
  },
  {
    name: '竊取科技',
    desc: '如果磚塊產量少於對手，則磚塊產量等於對手',
  },
  {
    name: '基礎之牆',
    desc: '城牆+3',
  },
  {
    name: '穩固之牆',
    desc: '城牆+4',
  },
  {
    name: '發明創造',
    desc: '雙方磚塊產量同時+1，你還得到4個寶石',
  },
  {
    name: '穩固地基',
    desc: '如果沒有城牆，則城牆+6，否則城牆+3',
  },
  {
    name: '顫動微震',
    desc: '雙方城牆同時-5，再次出牌',
  },
  {
    name: '秘密房間',
    desc: '寶石產量+1，再次出牌',
  },
  {
    name: '突發地震',
    desc: '雙方磚塊產量同時-1',
  },
  {
    name: '高大城牆',
    desc: '城牆+6',
  },
  {
    name: '礦坑坍塌',
    desc: '對手磚塊產量-1',
  },
  {
    name: '新型設備',
    desc: '磚塊產量+2',
  },
  {
    name: '礦坑濫墾',
    desc: '磚塊產量-1，城牆+10，寶石+5',
  },
  {
    name: '強化牆壁',
    desc: '城牆+8',
  },
  {
    name: '神秘閘門',
    desc: '城牆+5，魔獸產量+1',
  },
  {
    name: '水晶礦石',
    desc: '城牆+7，寶石+7',
  },
  {
    name: '和諧礦石',
    desc: '城牆+6，塔樓+3',
  },
  {
    name: '無邊牆壁',
    desc: '城牆+12',
  },
  {
    name: '專注設計',
    desc: '城牆+8，塔樓+5',
  },
  {
    name: '偉大之牆',
    desc: '城牆+15',
  },
  {
    name: '巨石投擊',
    desc: '城牆+6，10點攻擊',
  },
  {
    name: '神龍之心',
    desc: '城牆+20，塔樓+8',
  },
  {
    name: '強制勞動',
    desc: '城牆+9，魔獸-5',
  },
  {
    name: '岩石花園',
    desc: '城牆+1，塔樓+1，魔獸+2',
  },
  {
    name: '洪澇災害',
    desc: '城牆最低者魔獸產量-1，塔樓-2',
  },
  {
    name: '兵營訓練',
    desc: '魔獸+6，城牆+6，如果魔獸產量小於對手，則魔獸產量+1',
  },
  {
    name: '防禦工事',
    desc: '城牆+7，6點攻擊',
  },
  {
    name: '乾坤挪移',
    desc: '將你和對手的城牆互換',
  },
  {
    name: '石英寶石',
    desc: '塔樓+1，再次出牌',
  },
  {
    name: '煙霧石英',
    desc: '對手塔樓-1，再次出牌',
  },
  {
    name: '紫色水晶',
    desc: '塔樓+3',
  },
  {
    name: '魔法編織',
    desc: '寶石產量+1',
  },
  {
    name: '三稜魔鏡',
    desc: '換一張牌後，再次出牌',
  },
  {
    name: '怪石纏身',
    desc: '塔樓+3，這張牌不能換，只能使用',
  },
  {
    name: '太陽耀斑',
    desc: '塔樓+2，對手塔樓-2',
  },
  {
    name: '水晶矩陣',
    desc: '寶石產量+1，塔樓+3，對手塔樓+1',
  },
  {
    name: '寶石裂痕',
    desc: '對手塔樓-3',
  },
  {
    name: '深紅寶石',
    desc: '塔樓+5',
  },
  {
    name: '水晶之矛',
    desc: '對手塔樓-5',
  },
  {
    name: '熊熊烈火',
    desc: '塔樓-5，寶石產量+2',
  },
  {
    name: '和諧氛圍',
    desc: '寶石產量+1，塔樓+3，城牆+3',
  },
  {
    name: '平均分配',
    desc: '雙方寶石產量等於產量高的一方',
  },
  {
    name: '神奇翡翠',
    desc: '塔樓+8',
  },
  {
    name: '智慧珍珠',
    desc: '塔樓+5，寶石產量+1',
  },
  {
    name: '碎裂狂徒',
    desc: '寶石產量-1，對手塔樓-9',
  },
  {
    name: '碎裂岩石',
    desc: '塔樓+5，對手磚塊-6',
  },
  {
    name: '藍色寶石',
    desc: '塔樓+11',
  },
  {
    name: '不可調和',
    desc: '雙方塔樓同時-7，寶石產量同時-1',
  },
  {
    name: '火紅寶石',
    desc: '塔樓+6，對手塔樓-4',
  },
  {
    name: '礦場協助',
    desc: '塔樓+7，磚塊-10',
  },
  {
    name: '水晶護盾',
    desc: '塔樓+8，城牆+3',
  },
  {
    name: '同理心石',
    desc: '塔樓+8，魔獸產量+1',
  },
  {
    name: '鑽石永恆',
    desc: '塔樓+15',
  },
  {
    name: '庇護聖地',
    desc: '塔樓+10，城牆+5，魔獸+5',
  },
  {
    name: '熔岩寶石',
    desc: '塔樓+12，6點攻擊',
  },
  {
    name: '神龍之眼',
    desc: '塔樓+20',
  },
  {
    name: '結晶寶石',
    desc: '塔樓+11，城牆-6',
  },
  {
    name: '雜物之袋',
    desc: '如果塔樓少於對手，則塔樓+2，否則+1',
  },
  {
    name: '雨後彩虹',
    desc: '雙方塔樓同時+1，己方寶石+3',
  },
  {
    name: '魔法學徒',
    desc: '塔樓+4，魔獸-3，對手塔樓-2',
  },
  {
    name: '閃電碎片',
    desc: '如果塔樓數多於對手城牆數，則對手塔樓-8，否則8點攻擊',
  },
  {
    name: '相位寶石',
    desc: '塔樓+13，魔獸+6，磚塊+6',
  },
  {
    name: '瘋牛疾病',
    desc: '雙方魔獸同時-6',
  },
  {
    name: '幻境仙子',
    desc: '2點攻擊，再次出牌',
  },
  {
    name: '無常地精',
    desc: '4點攻擊，寶石-3',
  },
  {
    name: '牛頭巨人',
    desc: '魔獸產量+1',
  },
  {
    name: '精靈密探',
    desc: '換一張牌後，再次出牌',
  },
  {
    name: '地精暴徒',
    desc: '6點攻擊，己方遭受3點攻擊',
  },
  {
    name: '地精射手',
    desc: '對手塔樓-3，己方遭受1點攻擊',
  },
  {
    name: '暗影仙子',
    desc: '對手塔樓-2，再次出牌',
  },
  {
    name: '獸人進攻',
    desc: '5點攻擊',
  },
  {
    name: '矮人小隊',
    desc: '4點攻擊，城牆+3',
  },
  {
    name: '隱秘小蛇',
    desc: '對手塔樓-4',
  },
  {
    name: '巨魔訓練',
    desc: '魔獸產量+2',
  },
  {
    name: '高塔之妖',
    desc: '2點攻擊，城牆+4，塔樓+2',
  },
  {
    name: '滿月之夜',
    desc: '雙方魔獸產量同時+1，你再得到3個魔獸',
  },
  {
    name: '殺人魔鬼',
    desc: '6點攻擊',
  },
  {
    name: '食人巨妖',
    desc: '7點攻擊',
  },
  {
    name: '狂暴公羊',
    desc: '6點攻擊，對手魔獸-3',
  },
  {
    name: '惡鬼作怪',
    desc: '6點攻擊，雙方磚塊、寶石和魔獸同時-5',
  },
  {
    name: '噴火甲蟲',
    desc: '對手沒有城牆時10點攻擊，否則6點攻擊',
  },
  {
    name: '半人半狼',
    desc: '9點攻擊',
  },
  {
    name: '腐蝕之雲',
    desc: '對手沒有城牆時7點攻擊，否則10點攻擊',
  },
  {
    name: '獨角神獸',
    desc: '寶石產量多於對手時12點攻擊，否則8點',
  },
  {
    name: '精靈射手',
    desc: '城牆少於對手時6點攻擊，否則對手塔樓-6',
  },
  {
    name: '魅惑女妖',
    desc: '對手塔樓-5，魔獸-8',
  },
  {
    name: '碎巖魔獸',
    desc: '8點攻擊，對手磚塊產量-1',
  },
  {
    name: '無影神偷',
    desc: '對手寶石-10，磚塊-5，你得到其中一半（向上取整）',
  },
  {
    name: '岩石巨人',
    desc: '10點攻擊，城牆+4',
  },
  {
    name: '吸血殭屍',
    desc: '10點攻擊，對手魔獸-5，魔獸產量-1',
  },
  {
    name: '無敵天龍',
    desc: '20點攻擊，對手寶石-10，魔獸產量-1',
  },
  {
    name: '長矛槍兵',
    desc: '如果城牆多於對手，則3點攻擊，否則2點攻擊',
  },
  {
    name: '頑皮侏儒',
    desc: '3點攻擊，寶石+1',
  },
  {
    name: '狂暴戰士',
    desc: '8點攻擊，己方塔樓-3',
  },
  {
    name: '戰爭之王',
    desc: '13點攻擊，己方寶石-3',
  },
  {
    name: '飛馬騎士',
    desc: '對手塔樓-12',
  },
]
