import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: '砖块短缺',
    desc: '双方同时失去8块砖头',
  },
  {
    name: '幸运宝藏',
    desc: '砖头+2，宝石+2，再次出牌',
  },
  {
    name: '友善地形',
    desc: '城墙+1，再次出牌',
  },
  {
    name: '伟大矿工',
    desc: '砖头产量+1',
  },
  {
    name: '矿石主脉',
    desc: '如果砖头产量少于对手，则砖头产量+2，否则+1',
  },
  {
    name: '矮人矿工',
    desc: '城墙+4，砖头产量+1',
  },
  {
    name: '加班工作',
    desc: '城墙+5，宝石-6',
  },
  {
    name: '窃取科技',
    desc: '如果砖头产量少于对手，则砖头产量等于对手',
  },
  {
    name: '基础之墙',
    desc: '城墙+3',
  },
  {
    name: '稳固之墙',
    desc: '城墙+4',
  },
  {
    name: '技术创新',
    desc: '双方砖头产量同时+1，你还得到4个宝石',
  },
  {
    name: '稳固地基',
    desc: '如果没有城墙，则城墙+6，否则城墙+3',
  },
  {
    name: '颤动微震',
    desc: '双方城墙同时-5，再次出牌',
  },
  {
    name: '秘密房间',
    desc: '宝石产量+1，再次出牌',
  },
  {
    name: '突发地震',
    desc: '双方砖头产量同时-1',
  },
  {
    name: '高大城墙',
    desc: '城墙+6',
  },
  {
    name: '矿坑坍塌',
    desc: '对手砖头产量-1',
  },
  {
    name: '新型设备',
    desc: '砖头产量+2',
  },
  {
    name: '矿坑滥垦',
    desc: '砖头产量-1，城墙+10，宝石+5',
  },
  {
    name: '强化墙壁',
    desc: '城墙+8',
  },
  {
    name: '神秘闸门',
    desc: '城墙+5，怪物产量+1',
  },
  {
    name: '水晶宝石',
    desc: '城墙+7，宝石+7',
  },
  {
    name: '和谐矿石',
    desc: '城墙+6，城堡+3',
  },
  {
    name: '无边之墙',
    desc: '城墙+12',
  },
  {
    name: '专注设计',
    desc: '城墙+8，城堡+5',
  },
  {
    name: '伟大之墙',
    desc: '城墙+15',
  },
  {
    name: '巨石投击',
    desc: '城墙+6，10点攻击',
  },
  {
    name: '神龙之心',
    desc: '城墙+20，城堡+8',
  },
  {
    name: '强制劳役',
    desc: '城墙+9，怪物-5',
  },
  {
    name: '岩石花园',
    desc: '城墙+1，城堡+1，怪物+2',
  },
  {
    name: '洪涝灾害',
    desc: '城墙最低者怪物产量-1，城堡-2',
  },
  {
    name: '兵营训练',
    desc: '怪物+6，城墙+6，如果怪物产量小于对手，则怪物产量+1',
  },
  {
    name: '防御工事',
    desc: '城墙+7，6点攻击',
  },
  {
    name: '乾坤挪移',
    desc: '将你和对手的城墙互换',
  },
  {
    name: '石英宝石',
    desc: '城堡+1，再次出牌',
  },
  {
    name: '烟雾石英',
    desc: '对手城堡-1，再次出牌',
  },
  {
    name: '紫色水晶',
    desc: '城堡+3',
  },
  {
    name: '魔法编织',
    desc: '宝石产量+1',
  },
  {
    name: '三棱魔镜',
    desc: '换一张牌后，再次出牌',
  },
  {
    name: '怪石缠身',
    desc: '城堡+3，这张牌不能换，只能使用',
  },
  {
    name: '太阳耀斑',
    desc: '城堡+2，对手城堡-2',
  },
  {
    name: '水晶矩阵',
    desc: '宝石产量+1，城堡+3，对手城堡+1',
  },
  {
    name: '宝石裂痕',
    desc: '对手城堡-3',
  },
  {
    name: '深红宝石',
    desc: '城堡+5',
  },
  {
    name: '水晶之矛',
    desc: '对手城堡-5',
  },
  {
    name: '焚心以火',
    desc: '城堡-5，宝石产量+2',
  },
  {
    name: '和谐氛围',
    desc: '宝石产量+1，城堡+3，城墙+3',
  },
  {
    name: '公平竞争',
    desc: '双方宝石产量等于产量高的一方',
  },
  {
    name: '神奇翡翠',
    desc: '城堡+8',
  },
  {
    name: '智慧珍珠',
    desc: '城堡+5，宝石产量+1',
  },
  {
    name: '碎裂狂徒',
    desc: '宝石产量-1，对手城堡-9',
  },
  {
    name: '酥碎之石',
    desc: '城堡+5，对手砖头-6',
  },
  {
    name: '蓝色宝石',
    desc: '城堡+11',
  },
  {
    name: '不可调和',
    desc: '双方城堡同时-7，宝石产量同时-1',
  },
  {
    name: '火红宝石',
    desc: '城堡+6，对手城堡-4',
  },
  {
    name: '搬砖以助',
    desc: '城堡+7，砖头-10',
  },
  {
    name: '水晶护盾',
    desc: '城堡+8，城墙+3',
  },
  {
    name: '同理心石',
    desc: '城堡+8，怪物产量+1',
  },
  {
    name: '钻石永恒',
    desc: '城堡+15',
  },
  {
    name: '庇护圣地',
    desc: '城堡+10，城墙+5，怪物+5',
  },
  {
    name: '熔岩宝石',
    desc: '城堡+12，6点攻击',
  },
  {
    name: '神龙之眼',
    desc: '城堡+20',
  },
  {
    name: '结晶宝石',
    desc: '城堡+11，城墙-6',
  },
  {
    name: '杂物之袋',
    desc: '如果城堡少于对手，则城堡+2，否则+1',
  },
  {
    name: '雨后彩虹',
    desc: '双方城堡同时+1，己方宝石+3',
  },
  {
    name: '魔法学徒',
    desc: '城堡+4，怪物-3，对手城堡-2',
  },
  {
    name: '闪电碎片',
    desc: '如果城堡数多于对手城墙数，则对手城堡-8，否则8点攻击',
  },
  {
    name: '相位宝石',
    desc: '城堡+13，怪物+6，砖头+6',
  },
  {
    name: '疯牛疾病',
    desc: '双方怪物同时-6',
  },
  {
    name: '幻境仙子',
    desc: '2点攻击，再次出牌',
  },
  {
    name: '无常地精',
    desc: '4点攻击，宝石-3',
  },
  {
    name: '牛头巨人',
    desc: '怪物产量+1',
  },
  {
    name: '精灵密探',
    desc: '换一张牌后，再次出牌',
  },
  {
    name: '地精暴徒',
    desc: '6点攻击，己方遭受3点攻击',
  },
  {
    name: '地精射手',
    desc: '对手城堡-3，己方遭受1点攻击',
  },
  {
    name: '暗影仙子',
    desc: '对手城堡-2，再次出牌',
  },
  {
    name: '兽人进攻',
    desc: '5点攻击',
  },
  {
    name: '矮人小队',
    desc: '4点攻击，城墙+3',
  },
  {
    name: '隐秘小蛇',
    desc: '对手城堡-4',
  },
  {
    name: '巨魔训练',
    desc: '怪物产量+2',
  },
  {
    name: '高塔之妖',
    desc: '2点攻击，城墙+4，城堡+2',
  },
  {
    name: '满月之夜',
    desc: '双方怪物产量同时+1，你再得到3个怪物',
  },
  {
    name: '杀人魔鬼',
    desc: '6点攻击',
  },
  {
    name: '食人巨妖',
    desc: '7点攻击',
  },
  {
    name: '狂暴公羊',
    desc: '6点攻击，对手怪物-3',
  },
  {
    name: '恶鬼作怪',
    desc: '6点攻击，双方砖头、宝石和怪物同时-5',
  },
  {
    name: '喷火甲虫',
    desc: '对手没有城墙时10点攻击，否则6点攻击',
  },
  {
    name: '半人半狼',
    desc: '9点攻击',
  },
  {
    name: '腐蚀之云',
    desc: '对手有城墙时10点攻击，否则7点攻击',
  },
  {
    name: '独角神兽',
    desc: '宝石产量多于对手时12点攻击，否则8点攻击',
  },
  {
    name: '精灵射手',
    desc: '城墙多于对手时对手城堡-6，否则6点攻击',
  },
  {
    name: '魅惑女妖',
    desc: '对手城堡-5，怪物-8',
  },
  {
    name: '碎岩魔兽',
    desc: '8点攻击，对手砖头产量-1',
  },
  {
    name: '无影神偷',
    desc: '对手宝石-10，砖头-5，你得到其中一半（向上取整）',
  },
  {
    name: '岩石巨人',
    desc: '10点攻击，城墙+4',
  },
  {
    name: '吸血僵尸',
    desc: '10点攻击，对手怪物-5，怪物产量-1',
  },
  {
    name: '无敌天龙',
    desc: '20点攻击，对手宝石-10，怪物产量-1',
  },
  {
    name: '长矛枪兵',
    desc: '如果城墙多于对手，则3点攻击，否则2点攻击',
  },
  {
    name: '顽皮侏儒',
    desc: '3点攻击，宝石+1',
  },
  {
    name: '狂暴战士',
    desc: '8点攻击，己方城堡-3',
  },
  {
    name: '战争之王',
    desc: '13点攻击，己方宝石-3',
  },
  {
    name: '飞马骑士',
    desc: '对手城堡-12',
  },
]
