import { DataCardsI18nType } from '../types/dataCard'

export const cardsI18n: DataCardsI18nType = [
  {
    name: '生死抗爭',
    desc: '雙方同時失去8塊磚頭',
  },
  {
    name: '幸運寶藏',
    desc: '磚頭+2，寶石+2，再次出牌',
  },
  {
    name: '友誼之地',
    desc: '城牆+1，再次出牌',
  },
  {
    name: '偉大礦工',
    desc: '磚頭產量+1',
  },
  {
    name: '礦石之脈',
    desc: '如果磚頭產量少於對手，則磚頭產量+2，否則+1',
  },
  {
    name: '矮人之礦',
    desc: '城牆+4，磚頭產量+1',
  },
  {
    name: '努力工作',
    desc: '城牆+5，寶石-6',
  },
  {
    name: '幻影之手',
    desc: '如果磚頭產量少於對手，則磚頭產量等於對手',
  },
  {
    name: '基礎之牆',
    desc: '城牆+3',
  },
  {
    name: '穩固之牆',
    desc: '城牆+4',
  },
  {
    name: '發明創造',
    desc: '雙方磚頭產量同時+1，你還得到4個寶石',
  },
  {
    name: '穩固基礎',
    desc: '如果沒有城牆，則城牆+6，否則城牆+3',
  },
  {
    name: '顫動之地',
    desc: '雙方城牆同時-5，再次出牌',
  },
  {
    name: '神秘小屋',
    desc: '寶石產量+1，再次出牌',
  },
  {
    name: '山崩地裂',
    desc: '雙方磚頭產量同時-1',
  },
  {
    name: '雄偉之牆',
    desc: '城牆+6',
  },
  {
    name: '粉碎之錘',
    desc: '對手磚頭產量-1',
  },
  {
    name: '完美工具',
    desc: '磚頭產量+2',
  },
  {
    name: '矮人之錘',
    desc: '磚頭產量-1，城牆+10，寶石+5',
  },
  {
    name: '神奇之石',
    desc: '城牆+8',
  },
  {
    name: '神秘之力',
    desc: '城牆+5，怪物產量+1',
  },
  {
    name: '奇幻寶石',
    desc: '城牆+7，寶石+7',
  },
  {
    name: '幻想樂曲',
    desc: '城牆+6，城堡+3',
  },
  {
    name: '牢不可破',
    desc: '城牆+12',
  },
  {
    name: '完美設計',
    desc: '城牆+8，城堡+5',
  },
  {
    name: '魔幻之牆',
    desc: '城牆+15',
  },
  {
    name: '巨石轟擊',
    desc: '城牆+6，10點攻擊',
  },
  {
    name: '神龍之心',
    desc: '城牆+20，城堡+8',
  },
  {
    name: '死命工作',
    desc: '城牆+9，怪物-5',
  },
  {
    name: '石頭花園',
    desc: '城牆+1，城堡+1，怪物+2',
  },
  {
    name: '洪澇災害',
    desc: '城牆最低者怪物產量-1，城堡-2',
  },
  {
    name: '訓練營地',
    desc: '怪物+6，城牆+6，如果怪物產量小於對手，則怪物產量+1',
  },
  {
    name: '防禦工事',
    desc: '城牆+7，6點攻擊',
  },
  {
    name: '乾坤挪移',
    desc: '將你和對手的城牆互換',
  },
  {
    name: '藍色寶石',
    desc: '城堡+1，再次出牌',
  },
  {
    name: '奇幻之煙',
    desc: '對手城堡-1，再次出牌',
  },
  {
    name: '迷幻之手',
    desc: '城堡+3',
  },
  {
    name: '魔法高手',
    desc: '寶石產量+1',
  },
  {
    name: '三稜魔鏡',
    desc: '換一張牌後，再次出牌',
  },
  {
    name: '怪石纏身',
    desc: '城堡+3，這張牌不能換，只能使用',
  },
  {
    name: '陽光普照',
    desc: '城堡+2，對手城堡-2',
  },
  {
    name: '鑽石魔陣',
    desc: '寶石產量+1，城堡+3，對手城堡+1',
  },
  {
    name: '寶石裂痕',
    desc: '對手城堡-3',
  },
  {
    name: '深紅寶石',
    desc: '城堡+5',
  },
  {
    name: '水晶之矛',
    desc: '對手城堡-5',
  },
  {
    name: '焚心之火',
    desc: '城堡-5，寶石產量+2',
  },
  {
    name: '忠誠代價',
    desc: '寶石產量+1，城堡+3，城牆+3',
  },
  {
    name: '公平競爭',
    desc: '雙方寶石產量等於產量高的一方',
  },
  {
    name: '神奇翡翠',
    desc: '城堡+8',
  },
  {
    name: '智慧珍珠',
    desc: '城堡+5，寶石產量+1',
  },
  {
    name: '賭命狂徒',
    desc: '寶石產量-1，對手城堡-9',
  },
  {
    name: '崩潰之石',
    desc: '城堡+5，對手磚頭-6',
  },
  {
    name: '藍色水晶',
    desc: '城堡+11',
  },
  {
    name: '生死相鬥',
    desc: '雙方城堡同時-7，寶石產量同時-1',
  },
  {
    name: '幻火之石',
    desc: '城堡+6，對手城堡-4',
  },
  {
    name: '巨人奴僕',
    desc: '城堡+7，磚頭-10',
  },
  {
    name: '水晶護體',
    desc: '城堡+8，城牆+3',
  },
  {
    name: '心領神會',
    desc: '城堡+8，怪物產量+1',
  },
  {
    name: '鑽石永恆',
    desc: '城堡+15',
  },
  {
    name: '神聖領域',
    desc: '城堡+10，城牆+5，怪物+5',
  },
  {
    name: '岩漿飛濺',
    desc: '城堡+12，6點攻擊',
  },
  {
    name: '神龍之眼',
    desc: '城堡+20',
  },
  {
    name: '魔幻寶石',
    desc: '城堡+11，城牆-6',
  },
  {
    name: '雜物之袋',
    desc: '如果城堡少於對手，則城堡+2，否則+1',
  },
  {
    name: '雨後彩虹',
    desc: '雙方城堡同時+1，己方寶石+3',
  },
  {
    name: '魔法學徒',
    desc: '城堡+4，怪物-3，對手城堡-2',
  },
  {
    name: '閃電碎片',
    desc: '如果城堡數多於對手城牆數，則對手城堡-8，否則8點攻擊',
  },
  {
    name: '位相寶石',
    desc: '城堡+13，怪物+6，磚頭+6',
  },
  {
    name: '兇惡蠻牛',
    desc: '雙方怪物同時-6',
  },
  {
    name: '幻境仙女',
    desc: '2點攻擊，再次出牌',
  },
  {
    name: '狂野蠻族',
    desc: '4點攻擊，寶石-3',
  },
  {
    name: '百科全書',
    desc: '怪物產量+1',
  },
  {
    name: '精靈密探',
    desc: '換一張牌後，再次出牌',
  },
  {
    name: '敵我不分',
    desc: '6點攻擊，己方遭受3點攻擊',
  },
  {
    name: '野蠻射手',
    desc: '對手城堡-3，己方遭受1點攻擊',
  },
  {
    name: '神奇仙女',
    desc: '對手城堡-2，再次出牌',
  },
  {
    name: '食人巨魔',
    desc: '5點攻擊',
  },
  {
    name: '矮人工匠',
    desc: '4點攻擊，城牆+3',
  },
  {
    name: '靈蛇劇毒',
    desc: '對手城堡-4',
  },
  {
    name: '馴獸專家',
    desc: '怪物產量+2',
  },
  {
    name: '高塔之妖',
    desc: '2點攻擊，城牆+4，城堡+2',
  },
  {
    name: '月圓之夜',
    desc: '雙方怪物產量同時+1，你再得到3個怪物',
  },
  {
    name: '殺手無情',
    desc: '6點攻擊',
  },
  {
    name: '嗜血巨魔',
    desc: '7點攻擊',
  },
  {
    name: '惡靈魔獸',
    desc: '6點攻擊，對手怪物-3',
  },
  {
    name: '惡鬼作怪',
    desc: '6點攻擊，雙方磚頭、寶石和怪物同時-5',
  },
  {
    name: '噴火甲蟲',
    desc: '對手沒有城牆時10點攻擊，否則6點攻擊',
  },
  {
    name: '半人半狼',
    desc: '9點攻擊',
  },
  {
    name: '冷血殺手',
    desc: '對手沒有城牆時7點攻擊，否則10點攻擊',
  },
  {
    name: '獨角神獸',
    desc: '寶石產量多於對手時12點攻擊，否則8點',
  },
  {
    name: '精靈射手',
    desc: '城牆少於對手時6點攻擊，否則對手城堡-6',
  },
  {
    name: '絕命女妖',
    desc: '對手城堡-5，怪物-8',
  },
  {
    name: '上古魔獸',
    desc: '8點攻擊，對手磚頭產量-1',
  },
  {
    name: '無影神偷',
    desc: '對手寶石-10，磚頭-5，你得到其中一半（向上取整）',
  },
  {
    name: '岩石巨人',
    desc: '10點攻擊，城牆+4',
  },
  {
    name: '吸血殭屍',
    desc: '10點攻擊，對手怪物-5，怪物產量-1',
  },
  {
    name: '無敵天龍',
    desc: '20點攻擊，對手寶石-10，怪物產量-1',
  },
  {
    name: '長矛槍兵',
    desc: '如果城牆多於對手，則3點攻擊，否則2點攻擊',
  },
  {
    name: '頑皮小鬼',
    desc: '3點攻擊，寶石+1',
  },
  {
    name: '狂暴戰士',
    desc: '8點攻擊，己方城堡-3',
  },
  {
    name: '戰爭之王',
    desc: '13點攻擊，己方寶石-3',
  },
  {
    name: '飛馬騎士',
    desc: '對手城堡-12',
  },
]
