import { DataCardsI18nType } from '../types/dataCard'

export const cardsI18n: DataCardsI18nType = [
  {
    name: '生死抗争',
    desc: '双方同时失去8块砖头',
  },
  {
    name: '幸运宝藏',
    desc: '砖头+2，宝石+2，再次出牌',
  },
  {
    name: '友谊之地',
    desc: '城墙+1，再次出牌',
  },
  {
    name: '伟大矿工',
    desc: '砖头产量+1',
  },
  {
    name: '矿石之脉',
    desc: '如果砖头产量少于对手，则砖头产量+2，否则+1',
  },
  {
    name: '矮人之矿',
    desc: '城墙+4，砖头产量+1',
  },
  {
    name: '努力工作',
    desc: '城墙+5，宝石-6',
  },
  {
    name: '幻影之手',
    desc: '如果砖头产量少于对手，则砖头产量等于对手',
  },
  {
    name: '基础之墙',
    desc: '城墙+3',
  },
  {
    name: '稳固之墙',
    desc: '城墙+4',
  },
  {
    name: '发明创造',
    desc: '双方砖头产量同时+1，你还得到4个宝石',
  },
  {
    name: '稳固基础',
    desc: '如果没有城墙，则城墙+6，否则城墙+3',
  },
  {
    name: '颤动之地',
    desc: '双方城墙同时-5，再次出牌',
  },
  {
    name: '神秘小屋',
    desc: '宝石产量+1，再次出牌',
  },
  {
    name: '山崩地裂',
    desc: '双方砖头产量同时-1',
  },
  {
    name: '雄伟之墙',
    desc: '城墙+6',
  },
  {
    name: '粉碎之锤',
    desc: '对手砖头产量-1',
  },
  {
    name: '完美工具',
    desc: '砖头产量+2',
  },
  {
    name: '矮人之锤',
    desc: '砖头产量-1，城墙+10，宝石+5',
  },
  {
    name: '神奇之石',
    desc: '城墙+8',
  },
  {
    name: '神秘之力',
    desc: '城墙+5，怪物产量+1',
  },
  {
    name: '奇幻宝石',
    desc: '城墙+7，宝石+7',
  },
  {
    name: '幻想乐曲',
    desc: '城墙+6，城堡+3',
  },
  {
    name: '牢不可破',
    desc: '城墙+12',
  },
  {
    name: '完美设计',
    desc: '城墙+8，城堡+5',
  },
  {
    name: '魔幻之墙',
    desc: '城墙+15',
  },
  {
    name: '巨石轰击',
    desc: '城墙+6，10点攻击',
  },
  {
    name: '神龙之心',
    desc: '城墙+20，城堡+8',
  },
  {
    name: '死命工作',
    desc: '城墙+9，怪物-5',
  },
  {
    name: '石头花园',
    desc: '城墙+1，城堡+1，怪物+2',
  },
  {
    name: '洪涝灾害',
    desc: '城墙最低者怪物产量-1，城堡-2',
  },
  {
    name: '训练营地',
    desc: '怪物+6，城墙+6，如果怪物产量小于对手，则怪物产量+1',
  },
  {
    name: '防御工事',
    desc: '城墙+7，6点攻击',
  },
  {
    name: '乾坤挪移',
    desc: '将你和对手的城墙互换',
  },
  {
    name: '蓝色宝石',
    desc: '城堡+1，再次出牌',
  },
  {
    name: '奇幻之烟',
    desc: '对手城堡-1，再次出牌',
  },
  {
    name: '迷幻之手',
    desc: '城堡+3',
  },
  {
    name: '魔法高手',
    desc: '宝石产量+1',
  },
  {
    name: '三棱魔镜',
    desc: '换一张牌后，再次出牌',
  },
  {
    name: '怪石缠身',
    desc: '城堡+3，这张牌不能换，只能使用',
  },
  {
    name: '阳光普照',
    desc: '城堡+2，对手城堡-2',
  },
  {
    name: '钻石魔阵',
    desc: '宝石产量+1，城堡+3，对手城堡+1',
  },
  {
    name: '宝石裂痕',
    desc: '对手城堡-3',
  },
  {
    name: '深红宝石',
    desc: '城堡+3',
  },
  {
    name: '水晶之矛',
    desc: '对手城堡-5',
  },
  {
    name: '焚心之火',
    desc: '宝石产量+2，城堡-5',
  },
  {
    name: '忠诚代价',
    desc: '宝石产量+1，城堡+3，城墙+3',
  },
  {
    name: '公平竞争',
    desc: '双方宝石产量等于产量高的一方',
  },
  {
    name: '神奇翡翠',
    desc: '城堡+8',
  },
  {
    name: '智慧珍珠',
    desc: '宝石产量+1，城堡+5',
  },
  {
    name: '赌命狂徒',
    desc: '宝石产量-1，对手城堡-9',
  },
  {
    name: '崩溃之石',
    desc: '城堡+5，对手砖头-6',
  },
  {
    name: '蓝色水晶',
    desc: '城堡+11',
  },
  {
    name: '生死相斗',
    desc: '双方宝石产量同时-1，城堡同时-7',
  },
  {
    name: '幻火之石',
    desc: '城堡+6，对手城堡-4',
  },
  {
    name: '巨人奴仆',
    desc: '城堡+7，砖头-10',
  },
  {
    name: '水晶护体',
    desc: '城堡+8，城墙+3',
  },
  {
    name: '心领神会',
    desc: '城堡+8，怪物产量+1',
  },
  {
    name: '钻石永恒',
    desc: '城堡+15',
  },
  {
    name: '神圣领域',
    desc: '城堡+10，城墙+5，怪物+5',
  },
  {
    name: '岩浆飞溅',
    desc: '城堡+12，6点攻击',
  },
  {
    name: '神龙之眼',
    desc: '城堡+20',
  },
  {
    name: '魔幻宝石',
    desc: '城堡+11，城墙-6',
  },
  {
    name: '杂物之袋',
    desc: '如果城堡少于对手，则城堡+2，否则+1',
  },
  {
    name: '雨后彩虹',
    desc: '双方城堡同时+1，己方宝石+3',
  },
  {
    name: '魔法学徒',
    desc: '城堡+4，怪物-3，对手城堡-2',
  },
  {
    name: '闪电碎片',
    desc: '如果城堡数多于对手城墙数，则对手城堡-8，否则8点攻击',
  },
  {
    name: '位相宝石',
    desc: '城堡+13，怪物+6，砖头+6',
  },
  {
    name: '凶恶蛮牛',
    desc: '双方怪物同时-6',
  },
  {
    name: '幻境仙女',
    desc: '2点攻击，再次出牌',
  },
  {
    name: '狂野蛮族',
    desc: '4点攻击，宝石-3',
  },
  {
    name: '百科全书',
    desc: '怪物产量+1',
  },
  {
    name: '精灵密探',
    desc: '换一张牌后，再次出牌',
  },
  {
    name: '敌我不分',
    desc: '6点攻击，己方遭受3点攻击',
  },
  {
    name: '野蛮射手',
    desc: '对手城堡-3，己方遭受1点攻击',
  },
  {
    name: '神奇仙女',
    desc: '对手城堡-2，再次出牌',
  },
  {
    name: '食人巨魔',
    desc: '5点攻击',
  },
  {
    name: '矮人工匠',
    desc: '4点攻击，城墙+3',
  },
  {
    name: '灵蛇剧毒',
    desc: '对手城堡-4',
  },
  {
    name: '驯兽专家',
    desc: '怪物产量+2',
  },
  {
    name: '高塔之妖',
    desc: '2点攻击，城墙+4，城堡+2',
  },
  {
    name: '月圆之夜',
    desc: '双方怪物产量同时+1，你再得到3个怪物',
  },
  {
    name: '杀手无情',
    desc: '6点攻击',
  },
  {
    name: '嗜血巨魔',
    desc: '7点攻击',
  },
  {
    name: '恶灵魔兽',
    desc: '6点攻击，对手怪物-3',
  },
  {
    name: '恶鬼作怪',
    desc: '6点攻击，双方砖头、宝石和怪物同时-5',
  },
  {
    name: '喷火甲虫',
    desc: '对手没有城墙时10点攻击，否则6点攻击',
  },
  {
    name: '半人半狼',
    desc: '9点攻击',
  },
  {
    name: '冷血杀手',
    desc: '对手没有城墙时7点攻击，否则10点攻击',
  },
  {
    name: '独角神兽',
    desc: '宝石产量多于对手时12点攻击，否则8点',
  },
  {
    name: '精灵射手',
    desc: '城墙少于对手时6点攻击，否则对手城堡-6',
  },
  {
    name: '绝命女妖',
    desc: '对手城堡-5，怪物-8',
  },
  {
    name: '上古魔兽',
    desc: '8点攻击，对手砖头产量-1',
  },
  {
    name: '无影神偷',
    desc: '对手宝石-10，砖头-5，你得到其中一半（向上取整）',
  },
  {
    name: '岩石巨人',
    desc: '10点攻击，城墙+4',
  },
  {
    name: '吸血僵尸',
    desc: '10点攻击，对手怪物-5，怪物产量-1',
  },
  {
    name: '无敌天龙',
    desc: '20点攻击，对手宝石-10，怪物产量-1',
  },
  {
    name: '长矛枪兵',
    desc: '如果城墙多于对手，则3点攻击，否则2点攻击',
  },
  {
    name: '顽皮小鬼',
    desc: '3点攻击，宝石+1',
  },
  {
    name: '狂暴战士',
    desc: '8点攻击，己方城堡-3',
  },
  {
    name: '战争之王',
    desc: '13点攻击，己方宝石-3',
  },
  {
    name: '飞马骑士',
    desc: '对手城堡-12',
  },
]
