import { TavernsI18nType } from '../types'

export const tavernsI18n: TavernsI18nType = [
  {
    name: 'في المنزل',
    location: 'هارمونديل',
  },
  {
    name: 'استراحة غريفين',
    location: 'إيراثيا',
  },
  {
    name: 'نزل إميرالد',
    location: 'غابة تولاري',
  },
  {
    name: 'العفريت المتغطرس',
    location: 'ديجا',
  },
  {
    name: 'المكان المألوف',
    location: 'صحراء براكادا',
  },
  {
    name: 'المشروب المبارك',
    location: 'سيليست',
  },
  {
    name: 'صالة مصاصي الدماء',
    location: 'الحفرة',
  },
  {
    name: 'الراهب الضاحك',
    location: 'جزيرة إيفينمورن',
  },
  {
    name: 'حماقة الحظ',
    location: 'جبل نيغون',
  },
  {
    name: 'منجم فقط',
    location: 'بارو داونز',
  },
  {
    name: 'المرتزقة المخلصون',
    location: 'تاتاليا',
  },
  {
    name: 'الجني الأصيص',
    location: 'أفلي',
  },
  {
    name: 'مشروب جروج',
    location: 'ستون سيتي',
  },
  {
    name: 'المشروب واليرقة',
    location: 'جزيرة داغر ووند',
  },
  {
    name: 'كانتينا كيسل',
    location: 'رافنشور',
  },
  {
    name: 'بيت الربح',
    location: 'ألفار',
  },
  {
    name: 'الحلق الجاف',
    location: 'صحراء آيرونساند',
  },
  {
    name: 'نزل دم التنين',
    location: 'خانق جاروت',
  },
  {
    name: 'شركة بلاك',
    location: 'شادوسباير',
  },
  {
    name: 'استراحة المسافر',
    location: 'غابات الميرم',
  },
  {
    name: 'نزل عين الثور',
    location: 'التجوال التخريبي',
  },
  {
    name: 'استراحة القراصنة',
    location: 'ريجنا',
  },
  {
    name: 'الغول الراقص',
    location: 'رافنشور',
  },
  {
    name: 'منزل ميهو على الطريق',
    location: 'ألفار',
  },
  {
    name: 'السيد أوزريك تيمبر',
    location: 'الملاذ الحر',
  },
  {
    name: 'السيد أنتوني ستون',
    location: 'المرتفعات المتجمدة',
  },
  {
    name: 'السيد إريك فون سترومجارد',
    location: 'المرتفعات المتجمدة',
  },
  {
    name: 'السيدة لوريتا فليس',
    location: 'خليج سيلفر',
  },
  {
    name: 'السيد ألبرت نيوتن',
    location: 'الجزر الضبابية',
  },
  {
    name: 'الأمير نيكولاي آيرونفيست',
    location: 'قلعة آيرونفيست',
  },
]
