import { TavernsI18nType } from '../types'

export const tavernsI18n: TavernsI18nType = [
  {
    name: 'За счет заведения',
    location: 'Хармондейл',
  },
  {
    name: 'Покой грифона',
    location: 'Эрафия',
  },
  // {
  //   name: 'Изумрудный двор',
  //   location: 'Тулареанский лес',
  // },
  {
    name: 'Снобистский гоблин',
    location: 'Дейя',
  },
  {
    name: 'Знакомое местечко',
    location: 'Пустыня Бракада',
  },
  {
    name: 'Благословенное варево',
    location: 'Небеса',
  },
  // {
  //   name: 'Бар Вампира',
  //   location: 'Бездна',
  // },
  {
    name: 'Смеющийся монах',
    location: 'Остров Эвенморн',
  },
  {
    name: 'Причуды фортуны',
    location: 'Гора Нигон',
  },
  {
    name: 'Шахтерская',
    location: 'Курганы',
  },
  {
    name: 'Лояльный наемник',
    location: 'Таталия',
  },
  // {
  //   name: 'Пьяные пикси',
  //   location: 'АвЛи',
  // },
  {
    name: 'Грог Грогга',
    location: 'Каменный город',
  },
  // {
  //   name: 'Грог и Закусь',
  //   location: 'Остров Кинжальной раны',
  // },
  // {
  //   name: 'Кофейня Кесселя',
  //   location: 'Воронов Берег',
  // },
  // {
  //   name: 'Доходный Дом',
  //   location: 'Альвар',
  // },
  // {
  //   name: 'Пересохшая Глотка',
  //   location: 'Железные Пески',
  // },
  // {
  //   name: 'На Драконьей Крови',
  //   location: 'Ущелье Удавки',
  // },
  // {
  //   name: 'Черный Отряд',
  //   location: 'Пик Теней',
  // },
  // {
  //   name: 'Отдых Путника',
  //   location: 'Шепчущий Лес',
  // },
  // {
  //   name: 'Гостиница "Яблочко"',
  //   location: 'Дикое Пастбище',
  // },
  // {
  //   name: 'Пиратский Притон',
  //   location: 'Регна',
  // },
  // {
  //   name: 'Танцующий Огр',
  //   location: 'Воронов Берег',
  // },
  // {
  //   name: 'Дом на Перекрестке',
  //   location: 'Альвар',
  // },
]
