import { TavernsI18nType } from '../types'

export const tavernsI18n: TavernsI18nType = [
  {
    name: 'За рахунок закладу',
    location: 'Хармондейл',
  },
  {
    name: 'Спокій грифона',
    location: 'Ератія',
  },
  // {
  //   name: 'Смарагдовий двір',
  //   location: 'Тулареанський ліс',
  // },
  {
    name: 'Снобістський гоблін',
    location: 'Дейя',
  },
  {
    name: 'Знайома місцина',
    location: 'Пустеля Бракада',
  },
  {
    name: 'Благословенне вариво',
    location: 'Небеса',
  },
  // {
  //   name: 'Бар Упиря',
  //   location: 'Безодня',
  // },
  {
    name: 'Монах що сміється',
    location: 'Острів Евенморн',
  },
  {
    name: 'Примхи фортуни',
    location: 'Гора Нігон',
  },
  {
    name: 'Шахтарська',
    location: 'Кургани',
  },
  {
    name: 'Лояльний Найманець',
    location: 'Таталія',
  },
  // {
  //   name: "П'яні піксі",
  //   location: 'АвЛі',
  // },
  {
    name: 'Грог Грогга',
    location: "Кам'яне місто",
  },
  // {
  //   name: 'Грог і Закусь',
  //   location: 'Острів Кинджального поранення',
  // },
  // {
  //   name: "Кав'ярня Кесселя",
  //   location: 'Воронячий Берег',
  // },
  // {
  //   name: 'Прибутковий Дім',
  //   location: 'Альвар',
  // },
  // {
  //   name: 'Пересохша Глотка',
  //   location: 'Залізні Піски',
  // },
  // {
  //   name: 'На Драконячій Крові',
  //   location: 'Ущелина Удавки',
  // },
  // {
  //   name: 'Чорний Загін',
  //   location: 'Пік Тіней',
  // },
  // {
  //   name: 'Відпочинок Подорожнього',
  //   location: 'Лес що Шепотить',
  // },
  // {
  //   name: 'Готель "Яблучко"',
  //   location: 'Дике Посовище',
  // },
  // {
  //   name: 'Піратський Притон',
  //   location: 'Регна',
  // },
  // {
  //   name: 'Огр що Танцює',
  //   location: 'Воронячий Берег',
  // },
  // {
  //   name: 'Дім на Перехресті',
  //   location: 'Альвар',
  // },
]
