import { DataCardsI18nType } from '../types/dataCard'

export const cardsI18n: DataCardsI18nType = [
  {
    name: 'Нехватка Кирпича',
    desc:
      "Оба игрока теряют по 8 Кирпичей",
  },
  {
    name: 'Удачная Находка',
    desc:
      "+2 Кирпича. +2 Самоцвета. Ходите снова",
  },
  {
    name: 'Благодатная Почва',
    desc:
      "+1 к Стене. Ходите снова",
  },
  {
    name: 'Горняки',
    desc: "+1 к Карьеру",
  },
  {
    name: 'Богатое Месторождение',
    desc:
      "Если Карьер < вражеского, то +2 к Карьеру. Иначе +1 к Карьеру",
  },
  {
    name: 'Горные Гномы',
    desc:
      "+4 к Стене. +1 к Карьеру",
  },
  {
    name: 'Сверхурочные',
    desc:
      '+5 к Стене. Вы теряете 6 Самоцветов',
  },
  {
    name: 'Шпионаж',
    desc:
      "Если Карьер < вражеского, то он становится равного уровня",
  },
  {
    name: 'Обычная Стена',
    desc: '+3 к Стене',
  },
  {
    name: 'Крепкая Стена',
    desc: '+4 к Стене',
  },
  {
    name: 'Инновации',
    desc: '+1 к Карьеру у обоих игроков. Вы получаете 4 Самоцвета',
  },
  {
    name: 'Фундамент',
    desc: "Если Стена = 0, то +6 к Стене. Иначе +3 к Стене",
  },
  {
    name: 'Землетрясение',
    desc: "5 ед. урона Стенам обоих игроков. Ходите снова",
  },
  {
    name: 'Тайная Комната',
    desc:
      "+1 к Магии. Ходите снова",
  },
  {
    name: 'Обрушение',
    desc:
      '-1 к Карьеру у обоих игроков',
  },
  {
    name: 'Высокая Стена',
    desc: '+6 к Стене',
  },
  {
    name: 'Обвал',
    desc: '-1 к Карьеру врага',
  },
  {
    name: 'Новое Оборудование',
    desc:
      "+2 к Карьеру",
  },
  {
    name: 'Опустошение Недр',
    desc:
      '-1 к Карьеру. +10 к Стене. +5 Самоцветов',
  },
  {
    name: 'Укреплённая Стена',
    desc:
      '+8 к Стене',
  },
  {
    name: 'Портик',
    desc:
      '+5 к Стене. +1 к Подземелью',
  },
  {
    name: 'Кристаллы Кварца',
    desc:
      '+7 к Стене. +7 Самоцветов',
  },
  {
    name: 'Поющая Руда',
    desc:
      '+6 к Стене. +3 к Башне',
  },
  {
    name: 'Бастион',
    desc:
      "+12 к Стене",
  },
  {
    name: 'Инженерное Решение',
    desc:
      "+8 к Стене. +5 к Башне",
  },
  {
    name: 'Великая Стена',
    desc:
      "+15 к Стене",
  },
  {
    name: 'Катапульта',
    desc: '+6 к Стене. 10 ед. урона врагу',
  },
  {
    name: 'Сердце Дракона',
    desc:
      "+20 к Стене. +8 к Башне",
  },
  {
    name: 'Рабский Труд',
    desc:
      '+9 к Стене. Вы теряете 5 Существ',
  },
  {
    name: 'Сад Камней',
    desc: '+1 к Стене. +1 к Башне. +2 Существа',
  },
  {
    name: 'Наводнение',
    desc:
      "-1 к Подземелью и 2 ед. урона Башне игрока с наименьшей Стеной",
  },
  {
    name: 'Казармы',
    desc: "+6 Существ. +6 к Стене. Если Подземелье < вражеского, то +1 к Подземелью",
  },
  {
    name: 'Зубчатые Стены',
    desc:
      '+7 к Стене. 6 ед. урона врагу',
  },
  {
    name: 'Сдвиг',
    desc:
      'Стены игроков меняются местами',
  },
  {
    name: 'Хрусталь',
    desc:
      '+1 к Башне. Ходите снова',
  },
  {
    name: 'Дымчатый Кварц',
    desc:
      "1 ед. урона Башне врага. Ходите снова",
  },
  {
    name: 'Аметист',
    desc: "+3 к Башне",
  },
  {
    name: 'Заклинатели',
    desc:
      "+1 к Магии",
  },
  {
    name: 'Призма',
    desc:
      "Возьмите 1 карту. Сбросьте 1 карту. Ходите снова",
  },
  {
    name: 'Магнит',
    desc: '+3 к Башне. Эту карту нельзя сбросить',
  },
  {
    name: 'Солнечная Вспышка',
    desc:
      "+2 к Башне. 2 ед. урона Башне врага",
  },
  {
    name: 'Матрица',
    desc:
      '+1 к Магии. +3 к Башне. +1 к Башне врага',
  },
  {
    name: 'Треснутый Камень',
    desc:
      "3 ед. урона Башне врага",
  },
  {
    name: 'Рубин',
    desc: '+5 к Башне',
  },
  {
    name: 'Кристальное Копьё',
    desc:
      "5 ед. урона Башне врага",
  },
  {
    name: 'Взрыв Силы',
    desc:
      "5 ед. урона вашей Башне. +2 к Магии",
  },
  {
    name: 'Гармония',
    desc:
      "+1 к Магии. +3 к Башне. +3 к Стене",
  },
  {
    name: 'Равенство',
    desc:
      'Магия обоих игроков становится равна наибольшей Магии',
  },
  {
    name: 'Изумруд',
    desc: '+8 к Башне',
  },
  {
    name: 'Жемчужина Мудрости',
    desc:
      '+5 к Башне. +1 к Магии',
  },
  {
    name: 'Разрушение',
    desc:
      '-1 к Магии. 9 ед. ',
  },
  {
    name: 'Камнедробилка',
    desc:
      '+5 к Башне. Враг теряет 6 Кирпичей',
  },
  {
    name: 'Сапфир',
    desc: "+11 к Башне",
  },
  {
    name: 'Раздор',
    desc: '7 ед. урона Башням и -1 к Магии у обоих игроков',
  },
  {
    name: 'Огненный Рубин',
    desc:
      '+6 к Башне. 4 ед. урона Башне врага',
  },
  {
    name: 'Помощь Горняков',
    desc: "+7 к Башне. Вы теряете 10 Кирпичей",
  },
  {
    name: 'Кристальный Щит',
    desc:
      "+8 к Башне. +3 к Стене",
  },
  {
    name: 'Камень Эмпатии',
    desc:
      '+8 к Башне. +1 к Подземелью',
  },
  {
    name: 'Алмаз',
    desc:
      "+15 к Башне",
  },
  {
    name: 'Святилище',
    desc: '+10 к Башне. +5 к Стене. +5 Существ',
  },
  {
    name: 'Лавовый Камень',
    desc:
      '+12 к Башне. 6 ед. урона врагу',
  },
  {
    name: 'Глаз Дракона',
    desc:
      '+20 к Башне',
  },
  {
    name: 'Кристаллизация',
    desc:
      "+11 к Башне. -6 к Стене",
  },
  {
    name: 'Бижутерия',
    desc:
      "Если Башня < вражеской, то +2 к Башне. Иначе +1 к Башне",
  },
  {
    name: 'Радуга',
    desc:
      "+1 к Башням обоих игроков. Вы получаете 3 Самоцвета",
  },
  {
    name: 'Подмастерье',
    desc: '+4 к Башне. 2 ед. урона Башне врага. Вы теряете 3 Существа',
  },
  {
    name: 'Молния',
    desc:
      "Если Башня > Стены врага, то 8 ед. урона Башне врага. Иначе 8 ед. урона",
  },
  {
    name: 'Фазовый Камень',
    desc:
      "+13 к Башне. +6 Существ. +6 Кирпичей",
  },
  {
    name: 'Коровье Бешенство',
    desc:
      'Оба игрока теряют по 6 Существ',
  },
  {
    name: 'Фея',
    desc:
      '2 ед. урона. Ходите снова',
  },
  {
    name: 'Жадные Гоблины',
    desc:
      "4 ед. урона. Вы теряете 3 Самоцвета",
  },
  {
    name: 'Минотавр',
    desc: "+1 к Подземелью",
  },
  {
    name: 'Эльф-разведчик',
    desc:
      'Возьмите 1 карту. Сбросьте 1 карту. Ходите снова',
  },
  {
    name: 'Толпа Гоблинов',
    desc:
      "6 ед. урона врагу. 3 ед. урона вам",
  },
  {
    name: 'Гоблины-лучники',
    desc:
      '3 ед. урона Башне врага. 1 ед. урона вам',
  },
  {
    name: 'Тёмная Фея',
    desc:
      "2 ед. урона Башне врага. Ходите снова",
  },
  {
    name: 'Орк',
    desc: '5 ед. урона врагу',
  },
  {
    name: 'Гномы',
    desc:
      '4 ед. урона врагу. +3 к Стене',
  },
  {
    name: 'Змейки',
    desc: '4 ед. урона Башне врага',
  },
  {
    name: 'Тролль-надзиратель',
    desc: '+2 к Подземелью',
  },
  {
    name: 'Гремлины',
    desc: '2 ед. урона врагу. +4 к Башне. +2 к Стене',
  },
  {
    name: 'Полнолуние',
    desc:
      "+1 к Подземельям обоих игроков. Вы получаете 3 Существа",
  },
  {
    name: 'Кромсатель',
    desc: '6 ед. урона врагу',
  },
  {
    name: 'Огр',
    desc: '7 ед. урона врагу',
  },
  {
    name: 'Бешеная Овца',
    desc:
      "6 ед. урона врагу. Враг теряет 3 Существа",
  },
  {
    name: 'Бес',
    desc:
      "6 ед. урона врагу. Оба игрока теряют по 5 ед. каждого ресурса",
  },
  {
    name: 'Жук-бомбардир',
    desc:
      "Если Стена врага = 0, то 10 ед. урона врагу. Иначе 6 ед урона",
  },
  {
    name: 'Оборотень',
    desc: '9 ед. урона',
  },
  {
    name: 'Едкое Облако',
    desc: 'Если Стена врага > 0, то 10 ед. урона врагу. Иначе 7 ед. урона',
  },
  {
    name: 'Единорог',
    desc:
      'Если Магия > вражеской, то 12 ед. урона врагу. Иначе 8 ед. урона',
  },
  {
    name: 'Эльфы-лучники',
    desc:
      "Если Стена > вражеской, то 6 ед. урона Башне врага. Иначе 6 ед. урона",
  },
  {
    name: 'Суккуб',
    desc:
      '5 ед. урона Башне врага. Враг теряет 8 Существ',
  },
  {
    name: 'Камнееды',
    desc:
      '8 ед. урона врагу. -1 к Карьеру врага',
  },
  {
    name: 'Вор',
    desc:
      'Враг теряет 10 Самоцветов и 5 Кирпичей. Вы получаете половину',
  },
  {
    name: 'Каменный Великан',
    desc:
      '+4 к Стене. 10 ед. урона врагу',
  },
  {
    name: 'Вампир',
    desc:
      '10 ед. урона врагу. -1 к Подземелью врага. Враг теряет 5 Существ',
  },
  {
    name: 'Дракон',
    desc:
      '20 ед. урона врагу. -1 к Подземелью врага. Враг теряет 10 Самоцветов',
  },
  {
    name: 'Копейщик',
    desc:
      "Если Стена > вражеской, то 3 ед. урона врагу. Иначе 2 ед. урона",
  },
  {
    name: 'Карлик',
    desc:
      "3 ед. урона врагу. +1 Самоцвет",
  },
  {
    name: 'Берсерк',
    desc: '8 ед. урона врагу. 3 ед. урона вашей Башне',
  },
  {
    name: 'Воитель',
    desc: "13 ед. урона врагу. Вы теряете 3 Самоцвета",
  },
  {
    name: 'Всадник на Пегасе',
    desc:
      '12 ед. урона Башне врага',
  },
]
