import { DataCardsI18nType } from '../types/dataCard'

export const cardsI18n: DataCardsI18nType = [
  {
    name: 'КИРПИЧ ТРЕСНУЛ',
    desc:
      "й С ЦЕ Я )4\nВка ааН ВОДЯ\n'/7 Вбе-игроки п5\nг леряют ло —)\nоГЕВ КИН Е е^\n7 177% П гр ЛАа\nАЙЕ к аЕЫ",
  },
  {
    name: 'СЧАСТЛИВАЯ МОВЕТКА',
    desc:
      "у „’ И^\nсерлжо И оЙ оаа МИ\n— 2/ кирпич&/ И@\nб 2 самоцвете\n]играем’ц‚юда ;\n77 Ё ‚//_/’-'‚",
  },
  {
    name: 'БЛАГОТАТНЛЯ ПОЧВА',
    desc:
      "«аооа Са О ЗСаИЕ\n+ ке ах\nх .‚игрвем‚‚с;д%;‚\nОСН Й '\n0 ЕГа ОНАЙ,\nОЕвОДеасо «АЕа",
  },
  {
    name: '°° ШАХТЕРЫ',
    desc: "!‚' ОН, ’?‚‘/;\n| +1Ъ‹кврьё?у;\n;. ‚ —ННЕ\n^ ууа\nАЛИа ) ае",
  },
  {
    name: 'БОЛЬШАЯ ЖИЛА',
    desc:
      "‹Если-карьер <//\n\n‚ чем'у врагатог от\n\nос скарьер +2. -5\n\nИначе карвер+-1)\nФ уууа",
  },
  {
    name: 'ШАХТЕРЫ-ГНОМЫ',
    desc:
      "лаСа СО ИЕ\nО ожйкослена х\n‚ —+1 к керьеруст\n.:’._ /;1 .:\"Г' !' . ‘.\nЕаа «АЕа",
  },
  {
    name: 'СВЕРХУРОЧНЫЕ',
    desc:
      '_ %;К ф рИЙр\n5 к стёне -_—^\n\n,‘ вы теряете 6° у\n„ самощаетев: с\n\n‚ ;_‚,‘ «Х \'///" ‘',
  },
  {
    name: 'РАЗРАБОТАЯ НЛАН',
    desc:
      "—- Если’карьер: < //\n/ чеиув'р;к%чот‚/'Ё\nкарьер становится /\n=ЛОТрРе\n‘вражескому?",
  },
  {
    name: 'ОБЫЧНАЯ СТЕНА',
    desc: 'аоп ОО ЙОМЕ\nОЙО 2аяо УЛЕ КЕ\nЗОООВДОЕе\nЕЛЛ\n\nЙ, ’Йг ; "\'/_и-_%',
  },
  {
    name: 'БОЛЬШАЯ СТЕНА',
    desc: 'ЕАа\nы 7 оТИ _\nлу\n\nЛЕЬ "\'/_и-_%',
  },
  {
    name: 'НОВШЕСТВА',
    desc: 'Р жареатоыс ;\n\nг озвсех игЁЁЁз‚ ,\nвы_0о. ‚\nі#;@улж',
  },
  {
    name: 'ФУНДАМЕНТ',
    desc: "РЕр ”\\сте.'.)‘ /\n, ТОИ[Ё’› костенес ^\n; че 4\nоее\nИЕ ч ) ооа",
  },
  {
    name: 'ТОЛУКИ',
    desc: "/` боВсе стены /-\nполучают пб 7<\n\n' 5 повреждений\nигр@еЭсно/% ё",
  },
  {
    name: 'СЕКРЕТНЫЙ ЗАЛ',
    desc:
      "— и ю вФ Ф Г\nая СЛа 1,\nР \"МБ/' й д_.;\n' ‘играем ВУ\nР ’_‚{/ ‚ ) -_‚1;\nГ:'_/‚‚‘‚/’ {723\n\n74 и е КЫ\n75 ’}‹/Е 7 т",
  },
  {
    name: 'ЗЕМЛЕТРЯСЕНИЕ',
    desc:
      '/’ р/—"" ,а‘щ;\nПЙ ",__"»‚77д‚и и\n# —ЧЪрьеаьГ @С‘_\nши и иги)&ч В\n. /’‚1//‚‚, ‘: х\nЕвДрасо «Аа',
  },
  {
    name: 'УСИЛЕННАЯ СТЕНА',
    desc: 'ОСН ле\nТ э ” ‘; ”\nО 4в ке\nЕСО 78\n_‘/‹‘- &/Ё ”',
  },
  {
    name: '',
    desc: '=1 карьер-врага _\n"',
  },
  {
    name: 'НОВОЕ ОБОРУДОВАНИЕ',
    desc:
      "— 5 УА ЧБМЕ Я )#\nПОЕОЗ ОНАИ Са ПЙ\nь‚.‘ ,‚/'/’2›, И7 ж‘%\nнн Е2 ) ж\nе Ке Датуоеоуй ЧВ\nЯ) 7776 Гф\n\n77 в) нд '9 7 ЗуйА, @",
  },
  {
    name: 'РУДНИК ОБВАЛИЯСЯ',
    desc:
      'лаСа ЗОНА\n\n74 карьер‚#юк_‘ё\n\n‘стенеувы. получает,\n\n\' ,БісвмбЦ;вет”;Ёе ;\n/ ,: ‚ ‚//.‚"‚',
  },
  {
    name: 'ВЕЛИКАЯ СТЕНА',
    desc:
      '.\n\n‘Д‚‚ › /_;\\\\‘ "ч з 7\nСЕДеОДАЕт\nаЫ 4";‘8/54 ст а\n_‘‚\'н,:’‚.-"‘]ш ха\n-“\'.\'[;:’‚ -’Ё‚Г% У :!3\nЕЕЕ ая',
  },
  {
    name: 'ГАЛЕРЕЙ',
    desc:
      'еролю о пЫ да ПЙА\nг Л и Т уеа\nу ‚‘*_+ 5к ач;бг.д?%\n- Е1 ктеницес т\nТЕг /С (\nРЕ У',
  },
  {
    name: 'ИРИСТАЛЬНАЯ ГОРА',
    desc:
      'йка ВЛО\n// ЧТ костенеуВыт сс\n7 полу\\дае‘!]& Л\n\n7 самоцветду ;\n) : ) 1,/‚/_! т',
  },
  {
    name: 'ПОЮЩИЙ УГОЛЬ',
    desc:
      'оаа ЧМЕ РО\n‚ б к стене — 7^\n„ — Зк Ба ы\n{ #2 7 ш\nГи ооа оАЛИ\n› 704 СА\n7',
  },
  {
    name: ': БАСТИОН',
    desc:
      "т й Т жй /\nоаяа НОЫ аа Оа\nГр ОНЕ\nГ и х\n\nНОеНТД |\n\nЕЛ ввтенесл\nГ ‘; й ,`‚›/../.1\n\n' 70е )» .-;",
  },
  {
    name: 'НОВЫЕ УСПЕХИ',
    desc:
      "Па СЕНУ ааЕ ЕЕ\n_-‘ \" : 'Р/‚ в_к /оп ЁХ ;.›'%\nЫАИ ‚51‘4/5']‚ аЛ\nае Оа\nОЕ е",
  },
  {
    name: 'ВЕЛИЧАЙШАЯ СТЕНА',
    desc:
      ".'; - /\",.’ ) ‚/‘;»/ '7/':\n\n‚ фИ Ч в;\n17713 в усдеВеоа\n) оо ОНИа ,\n› ИЕ .",
  },
  {
    name: 'СКАЛОМЕТ',
    desc: 'КЧво7я Са Ьо аНЕ ТЕЙЕ\n\n( ‘ед-.урона) › -\n\nУРОа\nКЕ {7',
  },
  {
    name: 'СЕРДЦЕ ДРАКОНА',
    desc:
      "ба итд Тна В Т РУ КА\n“СЧтлпюо г Орг\n70 к саваЕ с\nРа В‚Ё}Звцщз 2\nй 47 ‚ /1 ’/’;Г Ир\nУЕЙЕа ок АЫ\n\n:. М ‹'1",
  },
  {
    name: 'ЬЕЗ  ВЫХОДНЫХ!',
    desc:
      'Поле Са ООа ОЬ\n\nе 4;9-!‹21 {5\n\n! ы теряете: -\nаАа\n\n) 1а -6 -ве‚,///г)\n\n‚ #а 73\n\n” Б. @и» — Ср ЛЬ - В Ъъе? БР ЕЕ Е',
  },
  {
    name: 'САД КАМНЕЙ',
    desc: 'ЯЛ к БаЩне —^\n„+ дсвверя лс\n"Уат о ,-’‚:7‘! »',
  },
  {
    name: 'ГРУИТОВЫЕ ВедЫ',
    desc:
      "| ва ‚\n/ Игрок с` мёнбшей:\n. с’{жй полуп’%еі -А.\n—Ктемнице_ и %\n\n'/ урона &еБашЁдщ",
  },
  {
    name: 'КАЗАРМЫ',
    desc: "ЛЕ б Аверай в\nстЁнЁ;_если 'т‹емчк)ца\n-Рі;'к тешж% о",
  },
  {
    name: 'УКРЕПЛЕНИЯ',
    desc:
      'р +7 „й ’›’Ё‚\'-‘/"-\n‚ /7 к слене, о^\n„6 9[д.‚уродв‘,ррыу‚\n\nооа ’,/7/’1 ч',
  },
  {
    name: 'СДВИГ',
    desc:
      'оя оа ИЙ\nГО Таа -в\nВаша’й вражеская`\nслены меняются _\n— местами / =М',
  },
  {
    name: 'КВАРЦ',
    desc:
      'Пежсло оОЫ ЕЙЕ\n‚ СНЙск Башне о*\n„. зиграем, сноВас:\nМИаг ‚„‚;/г’ ‚\n‚ // К в 4/-сю.\nПЯТч ) оя',
  },
  {
    name: 'ДЫМЧАТЫЙ ЖВАРЦ',
    desc:
      "1еа ; На Ё\";\"'.'?'_\nЯ ы `Башне-\nр а.ъ‚йщэеи‚х:воізё\n\nН о, у 4 ’‚,’г у\n| 72 п)а",
  },
  {
    name: 'АМЕТИСТ',
    desc: "+ 3 к Башбе '",
  },
  {
    name: 'ТКАЧИ ЗАКЛИНАНИЙ',
    desc:
      "ЁИ‚ п Итоо ТОНЕ ВО\nт° Х ‚ В оу о» «,\nГУ Кр ОЫО В\nоНк Й-Ч#}_Э —\nаОЕ лТв ЗОГ ТОМЕ\n`.. '‚'1’; И ‚4:‚/14\n\n7 ПУЕ 9 ) х ад",
  },
  {
    name: 'ПРИЗМА',
    desc:
      "С 2а Е\n\n' ь- 1 карту, х\n\n'сбре›а‹:ть 1-карту,\nи[раеи'‹:новг/!) ;\nоо оо РЕар",
  },
  {
    name: 'РУДНАЯ ЖИЛА',
    desc: '— 8 к Башне-_;\n\nННа\n\nЛеТЕО НЕЬ\nА а',
  },
  {
    name: 'ЗАТМЕНИЕ',
    desc:
      "ат ка та .-,-_53: '‚\"’/,-\n- +2'к Башнё Кос\nг <2 ед. урона —\nБашнещ,›врд.) ;\nол ой СС",
  },
  {
    name: 'ММАТРИЦА',
    desc:
      '‚ \' ‚ :""11 3 ’‚3‘:;__\n\n: авО КО!\n\nа4н8 кЪёШ›Ё {\n\nНк Бац!н;рр‹)йв‚\nГ _’_› П пвАТрЭ',
  },
  {
    name: 'ТРЕЩИНА',
    desc:
      "2ОНЕ О ОАа\n‚‚1_’‚ /;‹'%\n/ ВОИеН\n'— Баш /БО’;Ё й\nР иа Ид\n\n“ і/.:‚;!/‚ /‹_:/;%\nЙИ",
  },
  {
    name: 'РУБИН',
    desc: '+5 к Башйе 7',
  },
  {
    name: 'КОПЬЕ',
    desc:
      "ПжСла СЕ НОЫ ао ЕЙЕ\nВМа\nГс = * 1\n= '‚Б_‚а ст.;‚}нп’, 7\n0Я) ол то ’„_//&›\nТ У, ее",
  },
  {
    name: 'ВЗРЫВ СИЛЫ',
    desc:
      "Са каа ОН ОЕ ИОИЙ\nПЬ д. о‘‚/д‘в,'-\n' соёёёе{е\\но_й: й\n\nж2 ›‹%М: `",
  },
  {
    name: 'ГАРМОНИЯ',
    desc:
      "Си ОН ОЕ П\nПАЙ2я СОН МНа Е\nГ і ’К МЁ/‘ 2 ‚.-Е—\n' ЗК.Эа Вун\nоЬ Зк ста с\n› и / ‚,1Л\nГ4 2\n” урата 15 оеот",
  },
  {
    name: '°° ПАРИТЕТ',
    desc:
      '—< „ММвгия всехот г /)\n\n" Г) ИГрОКОВ л) оОг\n\n\'; с становится -\nравна о22 ;\n\n2 оагии) /’?;гд\n\n—- Сильнейшего)',
  },
  {
    name: 'ЭМЕРАЛЬД',
    desc: '+ В к Башве_:',
  },
  {
    name: 'ЖЕМЧУГ МУДРОСТИ',
    desc:
      '‚.\'{: д/":"*:%-‹ё"/‚;\nО7 УЕЕ\n# ’,Ч-]б‹,( БаШве —^\nкО 1.:@»‹3%2— й\n) а оаа 17 оя З\n\n, Ра\nА ”11%‚ 7 Т^ е',
  },
  {
    name: 'ЛРОБЛЕНИЕ',
    desc:
      'у ‚ < КЯ )4\nорт ао ИОЙ\n! 9"""@0!“1 7ОВе\n! ед. урона -°\n‚ ‚Башвё%:вгр‘ /\n2А, пр # 7)/2',
  },
  {
    name: 'МЯГКИЙ КАМЕНЬ',
    desc:
      'й т жя) {\nф РУ Ра Ора\n+-5к Башйел с\n/ — враг 1 Га\n‚ — Вкиртичейс о\n` / ; оаПа',
  },
  {
    name: 'САНФИР',
    desc: "+ 37 к Башне '",
  },
  {
    name: 'РАЗДОРЫ',
    desc: '< кЛовд. урома с/\nоан\n„с иероков оо',
  },
  {
    name: 'ОГНЕННЫЙ РУБИН',
    desc:
      'ала оИЫ аьЕ ТЕЙЯ\n— +-6 ж Башев 7 75\nг Е4 едус урона _\n\nПЕМЕМ ООр',
  },
  {
    name: 'ПОМОЩЬ В РАБОТЕ',
    desc: "ПЛЕя СОЛ ое\n_( 'ЕЪКБЁЩНЁ_\" <\nы леряе\n` '.10_'е<ирт‚9ёъ): :",
  },
  {
    name: 'КРИСТАЛЛЬНЫЙ — ЩИТ',
    desc:
      "каач НАЫ ОДЙ.\nГОЛ аао УЕНО РОВЕ\nг о+ Вк Башне с —°\nы +‘3_к‚сх_)аф}'д:'_.д\nд ‚1›‚’7/' ’{Ё\n\nИХ #`",
  },
  {
    name: '3 ЭМПАТИЯ',
    desc:
      '|исаблкая УО ДОДЯ\nГОАа НУЛ о\nсВ к Башне с^\n„ 7еЙ котемницех ;\nГ92 17726 / ЛАа\n\n{ я /Д\n\n! и',
  },
  {
    name: 'АЛМАЗ',
    desc:
      "— ^ра ор -© в) 4\n‚/'5.\"/?3 ';'!};5& .‚Е'_‹‚Ё\nТОГО УЕИ ВО\nе /'Э/Ё у _‚'г_›\n__4.’&;7’/1 ./’ я '‹//\nиар о7 ИИ\nЁ:‘-‚і‚‚“ %\" & (‘:‚\n\n78 а77 Ь @ ы",
  },
  {
    name: 'ГОНА СТЫРЬ',
    desc: 'кка НОа ОИ\n74 10ж Башйет сс\n! —: 5‹;‹ слене —\n\nВЫ полум ;\nвар',
  },
  {
    name: 'СИЯНИЩИЙ АММЕНЬ',
    desc:
      'СЕ1р к БВатес сс\n#6 ед.«уроЕЁ"Ьсег;ч :\nк 71^ Вратам/ р\n\n1 ‚,:/ ; ’,_/‚.‘‚\'/! :',
  },
  {
    name: 'ГЛАЗ ДРАКОНА',
    desc:
      '„ Й о,\nреб л‚/‘і‘_‘‚{«`#”#\nиа ‹. МУ «и\nР дд‘;›‚‚..\'(_р г‚\n/ +20 ж х\n7 " д27 "‚’." 4 ТМ\n3 ооа ТИа\nр кка\n\n78 ‘Ё% аТ ЬЙ ы',
  },
  {
    name: 'ОТВЕРДЕНИЕ',
    desc:
      "са 2 й УТаЙУ ДОИА:\nП0Я (О ао аа е\n; .+'161 “КЬЁЁ‘ 25\n, ‚‚'- К’С{ч 7&‘.›/1\nоо оЙГ оежТ Иа\n' 4 */АЛЬ\n:«-\\/ “°",
  },
  {
    name: 'БИЖУТЕРИЯ',
    desc:
      "оТЕ, л’/;:'.:/-.—\n“ Если’Башня < ^<\n' враже%ъой*‚ю\n+ 2 к Башне: ,\n° Йваче Т)",
  },
  {
    name: '_ РАДУГА',
    desc:
      "Г х ъ вИ\n\n. , „е '‚/‚\n\nГЬ 1-х›‹— Башияю” 2\nГ всех игроков,\n\nоВЫ ПОЛЁ:‹! @Ф 7 ,\n\n‚ ’%‘с;_ямоцд›та’{ ,\n\n| РО И",
  },
  {
    name: 'ВСТУПЛЕНИЕ',
    desc: '^ - выултеряете: с\n‚ ё.›; 3\'%);;3&" Ё\n° бафке врагас',
  },
  {
    name: 'В',
    desc:
      "‘Если..паша _ Башня\n—> \\юг@стена прагау\nтоБ ед/урона\n\nащие! враса: .\nИначо, & одтро-'*‘\nвсёем игрокам,",
  },
  {
    name: 'СИНФАЗНОСТЬ',
    desc:
      "В лаа '‚; Ор\n—Н А3.к`Башнетос\nго- Э’Б зверей —\n\n-@-.Б'кирп‚ипві}‘ И\n\nоо й Т/",
  },
  {
    name: 'КОРОВЬЕ БЕШЕНСТВО.',
    desc:
      'Ока ро Й НЕ\nу 1-6.л б ана ОО\n; ° Все’игрожи ^^\nтеряют по“б-- —\n40 Г, РИЪЁМ"\nТЕГ оо аРЕа\nР а с-—жлЩ',
  },
  {
    name: '',
    desc:
      '4и аТ оаЕ ИЙ /\n},\'‚’4— "‘; 7 9%.&;\nса урона._ ^\nт 7/,‚ ’.н Г‚]’ ЧЕ\nОЕ оа\n\n/ !‹Ъ й с ат',
  },
  {
    name: '°° ГЮБЛИНЫ —',
    desc:
      "‚ и УОГО АЙ\n\nООО СОМ МЕЙ \"{'г\n4’ед. урона.^^<\n\n' Вьп‘‚т%р%@бі\\\nНОЬ .",
  },
  {
    name: '°° МИНОТАВР О —',
    desc: "-\nр ; ои #\n\" + Ток темнице\n\n' - ‚ “.'\\\n\n' й й\n\n[ ‚",
  },
  {
    name: 'ЗЛЬФЫ-СКАУТЫ —',
    desc:
      '„л ЗИР\n\n// Сдать 1 ЧЁР/ 76\n\n‚сёросить 1 Карту °\nиграем ;:нр,_іу\n\nи 2 /‚‘/) :',
  },
  {
    name: 'АРМИЯ ГОБЛИНОВ —',
    desc:
      "„л ЗИР ОА\n\nс 2 -волй Ма ка ФА\n\n'— 6 ёд. урона.” 77\n\n! Выпож%«в)ют_едз\n2 ОДЫУРОВРДо\nу ‘ 7/",
  },
  {
    name: 'ГОБЛИНЫ-ЛУЧНИКИ —',
    desc:
      '„л Р ОА\nлаЙа ВЙ\n‚ — З.ёд. урона /:\n/ — Башне врага:\nВы попу›ще{ел ;\n- ©ед; урона 2',
  },
  {
    name: 'ПРИЗРАЧНАЯ ФЕН —',
    desc:
      "ла ИЙ й\n— —2’ед. урона ос\nивражеской 'Башне.`\nИграею‚с[няр;‹ ;\n\n7^ ” 7Л/@",
  },
  {
    name: '',
    desc: '5 ед. урона —°',
  },
  {
    name: '°° ПЮМЫ —',
    desc:
      '‚\'"/.; ""7; ‚ ’.‚\')А:(.,/_\n\n-ОССО Ка\n\n/ ‚›.Ё“%в/у‹;р-‘в;дд_і…;\nР «":/З',
  },
  {
    name: 'МАЛЕНЬКИЕ ЗАМЕЙКИ',
    desc: '- ООО ИЕ\n\'З%—;‹дёв;ёёгк;\n» Ёв%дръет уА\n7 :_. "/ЙЪ, - о —Й',
  },
  {
    name: 'ТРОЛЛЬ-НАСТАВНИК —',
    desc: '+ 2’к темнице',
  },
  {
    name: 'ГРЕМЛИН В БАШНЕ',
    desc: '-р К/Й\nя Са о ала е\n‚ с дчед- урона —^\n\n+ 2 к Башне, —°',
  },
  {
    name: 'ПОЛНОЛУНИЕ —',
    desc:
      ") > Ми„ » В\n\n< @ ‚ Ра ДИ,\n' —-Е1 К лемницам” :\n‚ звсёех игроков.\n- Вы полумаете:3.\n` скоозверя ла",
  },
  {
    name: '‚° КРУШИТЕЛЬ —',
    desc: '6 ед. урона -',
  },
  {
    name: 'О 0',
    desc: '7 ед. урона_ Ё',
  },
  {
    name: 'БЕШЕНАЯ ОЮЩА —',
    desc:
      "я 3 аТ- лир К\nерла ля оааа В\n'— —6.ёд. уронас т›г\n/ Враг-тёряет 3,\n/ЗВЁРЯ//’,Г ;\nЙ Г)",
  },
  {
    name: 'О ЧЕ —',
    desc:
      "а в З ЛР ОА\n\n„‘ сбчед. урома. /^\n\n|Все ш’роо{Б теряют\n' по-5 ›‹;‹ё›_пичей.\n\n„вверей иг\nСамоцветов?",
  },
  {
    name: '°° ЖУЧАРА —',
    desc:
      "аЗИ й\nЕсли“стена усарага-\n‚ =0,то ЪЁЁ?' <\n« урона, иначе 6. ёд.\n„урона’тл, —",
  },
  {
    name: '° ОБОРОТЕНЬ —',
    desc: '9 едлурона',
  },
  {
    name: 'ЕДКОЕ ОБЛАКО',
    desc: '— Если слёна ераг с\nЕ\n‚урона,инаме”\nГ ед.урона»',
  },
  {
    name: 'ЕДИНОРОГ',
    desc:
      '‹ Еоли*иегь;з} ЛЙ\n\n—- Чем у.врага/то::;\n! 12/‚евц ‘урона,-\n\nиначе В ед. урона:\nпр уууа',
  },
  {
    name: 'ЗЛЬФЫ-ЛУЧНИКИ',
    desc:
      "“Если-стена. 2> чем -\n\n'- у врага, то 6“ед_с\n\nурова’Башне в_ръ‹ъ;\n\nИначе/ 6 еёд. урбна:\nи 7/а",
  },
  {
    name: '°° БУККУБЫ',
    desc:
      '— ^ 5 ад урона с\n{ Баецйе враса. —°\n- -Враг теряет В.\n7 ссузверей а',
  },
  {
    name: 'КАМНЕЕДЫ',
    desc:
      'Са каа йЙ СОН ТЫЕ\nОТУАДе ‚ оо\n<—> В(ед; Н с#<\nОМВа\n0Г ордотиот в РР ТЧА\n® ЛЕСа\nУРЕ у',
  },
  {
    name: '',
    desc:
      '<‚„ арраг теряют /:\n// 7А0_самоцветов; <\n‚ В5‚КИрПИЧ!и.`\nы по _\nполовину” ОЁ;}„;"""',
  },
  {
    name: 'КАМЕННЫЙ _ ГИГАНТ',
    desc:
      'са оаиа аЫЙ ГЕРО КАЛЕ\n\n: /10‘ ОУа ТРО е\n\n, гед. урона, —<\n: + ЁК.ЩЖ_ЬЁ\n\n% * /А›" и\n\nРУ ао ва а\nТИ и',
  },
  {
    name: 'ВАМПИР',
    desc:
      'ся. 10% ед. УР&З‹:‚_‹.С\n\n—° раг теряет\n\nо- Зреро о,\n коого 2\n\nЛ "ЁтеБ1ИИцф.Т',
  },
  {
    name: 'ДРАКОН',
    desc:
      '7220 ед.. уропд оо\nврагторяет 0\n/ — самоцветов,\n.1‘ к рго )твиі,цпш',
  },
  {
    name: 'КОПЬЕНОСЕЦ',
    desc:
      "« Если стема > /°\n\n: ч‹ём у врагауто ›7\n' де;ё. урома,\n\nиначе г ©д. урона\nКр йй @ //а",
  },
  {
    name: 'лиии',
    desc:
      "ееа е НОЙО ааЕ ОА\nв23 9. уго #,\nк) Е аМОИа г\n!:/'__/;'.’,':‹ъ’, ‚44Ё\n['-= \"ёу ^ ь @”",
  },
  {
    name: 'БЕРСЕРК',
    desc: 'Каа Са ОЙЕ ВОМЕ\n\nнар %Ё›о@’” К\nУ,\n\n7Е о ЕРа',
  },
  {
    name: 'ВОИЙТЕЛЬ',
    desc: "ПЕСЯ СОНа е\n\n‚ бд;уро›&‚‘іы <\nтерядте- 3 _\n\n„ “ксамо ”Ё'/гд",
  },
  {
    name: 'ВСАДННК НА ПЕГАСЕ',
    desc:
      'ол Йа ОМЕ\n\nИ7 1е оТа уа\n\nВ: %2(3:1.7 Яр\n\n$ `а\n\nаООО АЛ\n) ол оТа\nао ееа\nвр й',
  },
]
